{
  "name": "atshhandelssohn-54351265",
  "displayName": "keith326 の知見ノート",
  "exported": 1638453176,
  "pages": [
    {
      "title": "settings",
      "created": 1631440500,
      "updated": 1634122329,
      "id": "613dce72d40a7b00224fb545",
      "lines": [
        "settings",
        "[https://gyazo.com/f5aad8e143b8d197c25d5e884bb315a2]",
        "",
        "code: style.css",
        " @import url('https://fonts.googleapis.com/css2?family=M+PLUS+Rounded+1c:wght@100;300;400;500;700;800;900&display=swap');",
        " html, body, #editor, .grid li {",
        "     font-family: \"M PLUS Rounded 1c\", helvetica, arial, sans-serif ;",
        "     word-spacing: .4px;",
        " }",
        " strong.level.level-1 {",
        "     font-weight: bold;",
        " }",
        " strong.deco-\\* {",
        "     font-weight: 900;",
        " }",
        " strong.level {",
        "     font-weight: bold;",
        " }",
        " .deco-\\(:before {",
        "   \tcontent:\"[\";",
        "\t}",
        " .deco-\\(:after {",
        "    \tcontent:\"]\";",
        " }",
        " .deco-\\| {",
        "    position: absolute;",
        "    width: 100%;",
        "    text-align: center;",
        " }",
        " .deco-\\# {",
        "    color: #fff; /* 白文字 */",
        "    background-color: #6a6; /* 緑背景 */",
        "  }",
        "  .deco-\\! { /* 重要な部分は!を付ける */",
        "    color: #fff;",
        "    background-color: #e66; /* 赤背景 */",
        "    font-size: 1.2em; /* 重要なので最初から大きな文字にする */",
        "  }",
        ""
      ]
    },
    {
      "title": "イシュードリブンを無理やり嵌め込もうとするとうまくまとまらない",
      "created": 1638374024,
      "updated": 1638375633,
      "id": "61a79a700634f9001d8f6842",
      "lines": [
        "イシュードリブンを無理やり嵌め込もうとするとうまくまとまらない",
        "#閑話休題",
        "[** イシュードリブンが必ずしもうまく働くとは限らない]",
        "　自分が行っている基礎研究だと、そもそもイシューを見つけるところから始められないことに気づいた。どいういうことかというと、アイデアを出すことが仕事ではあるが、その問題意識は何か会社の売り上げを上げたい、といったことから問題分析をして既存の手法を組み合わせるのではなく、もっと原始的な妄想の段階から勝負がつくわけで、本来研究者はクリエイター属性の生き物なのではないだろうか？",
        "　その視点で考えると、解くべき問題は何か？という問いかけを原点にしてしまうと、そんなものは自分から作らなければならないというしごく当たり前の答えしか出てこない。では、妄想から始めるとして、研究者はどんな妄想力を養えば良い研究ができるのだろう？",
        "　とりわけ自分のいる分野は数が勝負というところがあって、あまりアイデアの質を吟味している暇はなく、とりあえず思いついたら、工学的視点で思いついたモデルが現実世界で現れるのかを考えた後に早速本格的に取り掛かる、という形である（これは割と多くの分野はそうであると思うけども）。",
        "　",
        "",
        ""
      ]
    },
    {
      "title": "メモアプリ",
      "created": 1638374511,
      "updated": 1638375017,
      "id": "61a79c6b057337001d085b64",
      "lines": [
        "メモアプリ",
        "#アプリ",
        "[** 数式を使うものや少し長くなりそうな高レベルなメモはNotion]",
        "　Scrapbox はまだしっかりまとめていないアイデアを書き留めておく付箋的な役割としては最適である。しかし、少し手の込んだメモやアイデアをまとめる必要があるときはあまり向いていないことが半年近く利用してきて感じるようになった。",
        "　研究論文のネタとかもどちらかというとscrapbox では満足にまとめられない。数行にわたる数式や最適化問題の記述などalignmentがあったほうが見やすい場合も何かと不便である。",
        "　そこで、Notionとの両立を考える必要がありそう。",
        "　もともと、scrapbox は議事録メモとして使っていたが、すぐに利用をやめてしまい、デスクトップアプリでメモをしていた。日報のテンプレートがその日ごとに作成されるようなスクリプトまでわざわざ書いていた。ところが、西尾泰和さんが公開しているscrapbox をみて、小ネタのアイデア帳、いわば付箋を貼るような感覚で利用していたため、自分もその感覚で使い始めたら、スマホで見たいときにも引き出せないデスクトップアプリで書いているのが馬鹿馬鹿しくなって本日に至る。",
        ""
      ]
    },
    {
      "title": "がん保険の補償金",
      "created": 1638365933,
      "updated": 1638366335,
      "id": "61a77ae678a1ae001ff19c4f",
      "lines": [
        "がん保険の補償金",
        "#閑話休題",
        "[** ネットバンクはがん保険に入っていればローンが保証される？]",
        "　ローンを組んだ時、普通死亡しなければ保険によるローンの保証はないが、ネットバンクでローンを組んだ場合、がん保険に加入していた場合、ローンが保証される！？（動画の42分当たりだったと思う）",
        "　",
        "[https://www.youtube.com/watch?v=WJTWMuyiy30]",
        "",
        ""
      ]
    },
    {
      "title": "イシューから始めよ",
      "created": 1625990127,
      "updated": 1638327426,
      "id": "60eaa3eccac808001c3162fd",
      "lines": [
        "イシューから始めよ",
        "#読書メモ #知的生産術 #安宅和人",
        "[https://scrapbox.io/files/6153333796aea7001fe32e52.png]",
        "",
        "[*** 序章]",
        "[** 「イシュー」＝答えを出すべき問い]",
        "　バリューのマトリクス",
        "[https://scrapbox.io/files/6153345ceb2273001d8422cc.png]",
        "[* イシュー度]…自分の置かれた局面でこの問題に答えを出す必要性の高さ",
        "[* 解の質]…そのイシューに対してどこまで明確に答えを出せているか",
        "本当にこなすべき仕事とは[! 赤い]部分であり、これを「バリューのある仕事」と世間では呼ばれる。",
        "しかし、イシュー度の高い問いを設定することはそうたやすいことではなく、様々な観点でのものの考え方や情報収集の仕方を身に付けなければならない。本書ではその本質を突く「イシュー」を見つけるための手法を5段階に大きく分けて紹介している。",
        "",
        "[*** 第一章：イシュードリブン：「解く」前に「見極める」]",
        "[** 「やってみないと分からない」を禁句にし、仮説によってスタンスを明確にすることを優先する]",
        "　イシューに答えを出すため",
        "　必要な情報・分析すべきことが分かるため",
        "　分析結果の解釈が明確になるため",
        "[** 何はともあれ「言葉」にする]",
        "　イシューや仮説は言葉として規定することに徹底する。ここが少しでもブレると最終的に言わんとしていることを汲み取りにくい。",
        "　[* 言葉で表現する時のポイント]",
        "　　「主語」と「動詞」を入れる",
        "　　「WHY」より「WHERE」「WHAT」「HOW」",
        "　　比較表現を入れる",
        "[** 良いイシュー＝「本質的な選択肢である」「深い仮説がある」「答えを出せる」]",
        "[** イシュー特定のための情報収集：]",
        "　[** 一次情報に触れる]",
        "　[** 基本情報（「数字」「問題意識」「フレームワーク」）をスキャンする]",
        "　[!** 集めすぎない・知りすぎない]",
        "",
        "[*** 第二章：仮説ドリブン]",
        "[** イシューの分解]",
        "[* イシュー分解の効用]",
        "1. 課題の全体像が見えやすくなる",
        "2. 分解によってサブイシューが構成されて，その中で優先順位がわかり，先に取り組むべき課題がわかる",
        "[* 型が存在する場合]",
        "　「WHERE」「WHAT」「HOW」に分けられることが多い",
        "[* 型が存在しない場合]",
        "　「最後に欲しいものは何か？」という問いかけからはじめ逆算によってイシューを分解する",
        ""
      ]
    },
    {
      "title": "結婚式の歴史",
      "created": 1638008095,
      "updated": 1638008749,
      "id": "61a20519a8e16400234177f2",
      "lines": [
        "結婚式の歴史",
        "#閑話休題",
        "[** 神前結婚式は大正から始まった儀式]",
        "　旧来、婚儀はどちらかの家で行われてきたらしく、「婿取り」か「嫁取り」どちらかということは時代によって主流が変わってきた歴史がある。",
        "　室町時代からは政略結婚がある程度上流階級では主流となり、恋愛結婚は低い階級でしか認められなかった。",
        "　現在のように神社で結婚式を挙げるというしきたりは意外と歴史は浅く、百年余りしかたっていない。",
        "　きっかけは明治33年、大正天皇と九条節子姫（貞明皇后）の宮中賢所大前で執り行われた御婚儀をきっかけとしている。",
        "　翌34年、この御婚儀に基づいて定められた次第による神前式は、現在の東京大神宮で初めて一般向けに執り行われ、それが全国各地に普及した。",
        ""
      ]
    },
    {
      "title": "最適化に関して思うこと",
      "created": 1637927501,
      "updated": 1637948413,
      "id": "61a0ca43390856001d32bf62",
      "lines": [
        "最適化に関して思うこと",
        "#閑話休題",
        "　数理最適化を世の中の問題に対して直接解決する道具として使うことはあまり興味がなくて、データ解析など社会に隠れているなにかを見つけるための道具としての数理最適化のほうが本当は実用性高いんじゃなかろうか？",
        "　データドリブンによる社会政策の決定は結局人間によって決定するため質的な変量を数理最適化という世界に詰め込むのはなんだか無理な話に感じてきた今日このごろ。だから、数理最適化はなかなかウケないのではないかと思うし、社会実装として解が使えないと評判が悪いのではないか？",
        "　こんな事を数理最適化の応用研究者には口が裂けても言えないことだけど。",
        " 要するに、数理最適化は機械学習やデータサイエンスに用いられる方面では活発的に研究されており、実用性というよりも無くてはならない技術として認められている。一方で、経営学の問題として数理最適化を[* 直接]適用したときは中々実用化の反応は芳しくない場合が多い。しかし、機械学習やデータサイエンスを通してソリューションを提供すると、より人の心に刺さるというか納得されやすいという所感である。",
        " まあそれは言われてみれば当たり前で、データを見せた方が現実世界との新規性が高いからである。数理モデルを介して得られた解というのはどこか現実世界をすっ飛ばしているようで、本当に最適化で得られた解が「本当に解決したい根本の問題（利益の最大化）に対して尤もらしい解決策であるか」を直感的に確かめることができないからである。",
        " したがって、数理最適化は「縁の下の力持ち」程度の役回りが一番有効的な利用の仕方であると考えている。",
        ""
      ]
    },
    {
      "title": "新しいテクノロジーは新たな課題を生むというパラドクス",
      "created": 1637936067,
      "updated": 1637937156,
      "id": "61a0ebba279a5900235bd992",
      "lines": [
        "新しいテクノロジーは新たな課題を生むというパラドクス",
        "#閑話休題",
        "",
        "　技術者がなぜ新しいテクノロジーを開発し続けるのか？もっと広い枠組みで考えると、なぜ人は新しいモノを生み出し続けるのか？",
        "　ひとえに人間は理性を持つ生き物でもあり、世界のあらゆるものを動物とは異なるプロセスで認識し、合理的に考える脳みそを持っているからに他ならない。",
        "　そうして人間は目の前にある課題に対して知恵を絞って楽にモノを生産し、楽に供給することを可能としてきた。こうした歩みは何よりも人間は同じプロセスを何度も行っていると退屈になり、それが苦痛へと変わるから、その苦痛から脱却するためだと考えることもできる（実際、最適化されずその苦痛を強いられている職場も沢山あるようにも思うけど、その代償として給料をもらっていると考えることもできる）。",
        "　人間はその同じプロセスを不快とする生き物である以上、この技術の歩みは止まらないだろう。もし技術革新を止めたいのであれば、人間から理性というものを根本的に抜いてしまわなければなるまい。",
        "",
        "　前述したように、同じルーティンを簡略化するため、そして不快をなくすために技術というのは生み出されるものであるが、それは同時にその技術自体が新たな問題を生み出すことになる。つまり、考えることが増えるのである。",
        "　考えても見れば、太古の人類は衣食住が満たされていればよかったものが、今は社会的立場や経済格差などあらゆる高次的な問題を生み出している。こうしたことは当然社会が技術や知識によって発展してきたからに他ならない。",
        "　だからこそ、人工知能は職を奪うという考え方ではなく、職を生むという考え方もできるわけである。人工知能の発展に伴って新たに考えなければならない問題が山のように生まれ、それが職業として成っていくのである。技術革新とは常に職業の変遷とともにある。",
        ""
      ]
    },
    {
      "title": "医学系論文誌のフォーマット（American Medical Association）",
      "created": 1637674876,
      "updated": 1637675288,
      "id": "619cef7563737a0022992e4d",
      "lines": [
        "医学系論文誌のフォーマット（American Medical Association）",
        "",
        "[** 例：]",
        "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2775740?utm_source=twitter&utm_medium=social_jamajno&utm_term=4457387405&utm_campaign=article_alert&linkId=110517531",
        "　パンデミック下の日本における自殺率の変化を調査した論文",
        "　ウェブページにあるキーラインを読むことで全体像がはっきりとわかるように工夫されている",
        " キーポイントには、論文のメインとなる「問い（仮説(イシュー)）」からはじまり、「発見」とその「意味」が提供される。",
        " アブストラクトも細分化されており、「問いの動機」、「研究目的」、「手法」「」",
        "",
        "[** Key Points]",
        "[* Question]  Have suicide rates in Japan increased during the coronavirus disease 2019 (COVID-19) pandemic?",
        "",
        "[* Findings]  In this cross-sectional study using national data on suicide mortality in Japan, including 90 048 individuals who died of suicide, suicide rates in 2020 compared with 2016 to 2019 were increased in October and November for men and in July through November for women, and the relative increases were particularly pronounced among men aged younger than 30 years and women aged younger than 30 years and 30 to 49 years.",
        "",
        "[* Meaning]  These findings suggest that the COVID-19 pandemic was associated with increases in suicide rates in Japan.",
        "",
        "[** Abstract]",
        "[* Importance]  There are concerns that suicide rates may have increased during the coronavirus disease 2019 (COVID-19) pandemic.",
        "",
        "[* Objective]  To assess whether suicide rates in Japan increased in April through November 2020 compared with previous years.",
        "",
        "[* Design, Setting, and Participants]  This cross-sectional study used national data obtained from the Ministry of Health, Labor and Welfare from 2016 to 2020 on the monthly number of individuals who died of suicide in Japan from January to November of 2016 to 2020.",
        "",
        "[* Exposure]  2020 vs previous years.",
        "",
        "[* Main Outcomes and Measures]  The main outcome was monthly suicide rates, calculated as the number of individuals who died of suicide divided by the total population. A difference-in-difference regression model was used to estimate the change in monthly suicide rates in April to November 2020 vs these months in 2016 to 2019.",
        "",
        "[* Results]  Analyses included 90 048 individuals (61 366 [68.1%] men) who died of suicide from 2016 to 2020. The difference-in-difference analysis of men showed that there was no increase in suicide rates from April through September 2020 compared with these months in 2016 to 2019, but that suicide rates were increased in October (difference-in-difference, 0.40 [95% CI, 0.14 to 0.67] suicide deaths per 100 000 population) and November (difference-in-difference, 0.34 [95% CI, 0.07 to 0.60] suicide deaths per 100 000 population). Among women, suicide rates in 2020 compared with 2016 to 2019 increased in July (difference-in-difference, 0.24 [95% CI, 0.09 to 0.38] suicide deaths per 100 000 population), August (difference-in-difference, 0.30 [95% CI, 0.16 to 0.45] suicide deaths per 100 000 population), September (difference-in-difference, 0.29 [95% CI, 0.15 to 0.44] suicide deaths per 100 000 population), October (difference-in-difference, 0.62 [95% CI, 0.48 to 0.77] suicide deaths per 100 000 population), and November (difference-in-difference, 0.29 [95% CI, 0.15 to 0.44] suicide deaths per 100 000 population). In secondary analyses in which the suicide rates of 2020 were compared with the expected rates based on trends from 2011 to 2019, the increases in suicide rates were most pronounced among men aged younger than 30 years (eg, November: observed vs expected rate ratio [RR], 1.48 [95% CI, 1.26-1.71]) and women aged younger than 30 years (eg, October: observed vs expected RR, 2.14 [95% CI, 1.76 to 2.52]) and 30 to 49 years (eg, October: observed vs expected RR, 2.30 [95% CI, 2.01 to 2.58]).",
        "",
        "[* Conclusions and Relevance]  These findings suggest that compared with previous years, suicide rates in Japan in 2020 increased in October and November for men and in July through November for women.",
        ""
      ]
    },
    {
      "title": "何故作業が進まないのか？",
      "created": 1637389068,
      "updated": 1637428475,
      "id": "61989309c42dfb00235a503f",
      "lines": [
        "何故作業が進まないのか？",
        "#効率性 #研究 #知的生産術",
        "",
        "[** ガイドする人がいなくなった]",
        " 修士課程までは指導教員が定期的に面談をアレンジし、その下で次回までに残すべき成果を与えてくれたため進めやすかった。",
        " しかし、博士課程に入ってからはそこがまるっきり自分で面倒を見る必要があるため、分からないところを明確にして相談できるところまで自分が持っていかなくてはならない。",
        " この心理的負担が指導教員を駆け込み寺のように利用していた修士課程の時と全く違う点であり、何故進捗感を感じないのかという理由の一つである。",
        "　しかし、考えても見れば当然自分の仕事は自分で進めなくてはならないわけであって、綿密に指導教員が面倒を見るというフェーズからは卒業しないといけない。",
        "　そう頑張ってきたのがこれまでの1年半で会ったが、いよいよ限界が来ている。当たり前だ。普通の企業でも進捗ミーティングは週に一回、最低でも隔週であるのが普通であり、そこで上司や同僚に意見をもらうのである。その機会を一切自らの意思で立っているわけだから自分の研究の視野が広がるチャンスを積極的に逃しているようなものである。",
        "　ある人は博士課程なんていうものは自分で進めるのが当たり前で指導教員とは研究内容の話はほとんどしなかったと自慢げに語る人がいるけども、そんなものは自慢にはならないし、むしろ相談力や報連相の基礎をこの人は持っているのか？と疑念を抱くだろう。",
        "　博士課程だから一人で進めなくてはならないというのは完全なる思い込みであり、積極的に周囲に意見を乞うてよいのである。というよりそうしなければならないのである。大切なのは[! 一度教わったことを二度も聞かないことである]。",
        "",
        "[** タスクを細分化し、日々のチェックポイントを作ることでモチベーションを上げる]",
        "　研究のガイダンスを自らで行わなければならない、という義務は一方で研究そのもののモチベーションが上がらないという問題にもしばしば遭遇する。",
        "　なぜなら、何をすべきなのかがよくわかっていないためである。",
        "　『エンジニアの知的生産術』では、ある調査によると、やることをリストアップするだけでもやる気のなかった60%以上の人はやる気が向上したという。それだけやることを言語化してアウトプットすることはまとまっていない脳内を整理するという意味で圧倒的にストレス解消に貢献する。",
        ""
      ]
    },
    {
      "title": "2021年10月の目標＆フィードバック",
      "created": 1632933712,
      "updated": 1637329633,
      "id": "6154974f8236560023b8f489",
      "lines": [
        "2021年10月の目標＆フィードバック",
        "#予定 #計画 #生活習慣 #2021年",
        "",
        "[**** 目標]",
        "",
        "一か月後，私は...",
        "",
        "[*** 研究]",
        "[** 1. 論文を完成させている]",
        " ",
        "",
        "[**- 2. PHMが擬単調に拡張できるかどうかを検討する] ⇒ ひとまず保留",
        "　いまだに不明 → 近接点法の部分をEG法にしたら動きはするだろうか？ちょっとわからないし，うまくいきそうか不安なのでこれ以上リスクを負わないために確実に進められるものへと変更する．⇒ 研究として確実に遂行できる，または大幅な修正が必要かどうかを明確にする",
        "",
        "[** 3. 二段階分布的ロバスト変分不等式問題に対する期待残差最小化を提案している]",
        "　Chen and Jie (2017) が提案した正則化ギャップ関数によるERMを考える代わりに Chen et al. (2012) で提案したメリット関数を用いて二段階分布的ロバスト変分不等式に対するERMを考えられないだろうか？",
        "　この関数を用いるメリットとしては凸性の条件が正則化ギャップ関数よりも緩くなることがある（計算としては少し面倒だが）",
        "",
        "[**- 4. 変分不等式問題に対するスパース解の構成方法についてなぜ]",
        " [- 過去に研究室の修士学生が取り組んでいたものを非線形や一般の凸集合に拡張させたものを提案する]",
        " [- なぜまだ変分不等式への拡張が思うように進んでいないのか明らかにする．]",
        "",
        "[*** その他の勉強]",
        "[** 1. Kaggle のチュートリアルを完了している]",
        " 完了（9月10日）",
        " Intermediate 終了",
        " 開催中のコンペに参加する",
        "",
        "[** 2. Kaggle本2章を読み終えている]",
        " ほんの少し最後の部分を残した状態",
        "",
        "[** 3. 『イシューからはじめよ』第3章を読み終えている]",
        "　全く",
        "",
        "[** 4. 3の内容をscrapboxにまとめられている]",
        "　全く",
        "",
        "[** 5. TOEIC の勉強を始めている]",
        "　毎日10分リスニング問題を解く",
        "　毎日10分リーディング問題を解く",
        "　毎日5分英単語を勉強する",
        "　\tキクタン本ベースで進まないなら，その単語をiKnow!に登録して勉強しやすくするなど工夫をする",
        "",
        "[**- 6. TOEIC の申し込みを終えている]",
        "",
        "[*** 生活習慣]",
        "[** 1. 睡眠習慣の固定化]",
        "　先月は全く手に付けられなかった．無理に朝方にシフトする必要はない．正直，夜中の2時くらいに寝て10時から10時30分くらいまで起きるくらいがちょうど自分が求めている睡眠の快感が得られる．まずは以下の二点を達成できるように行動する．",
        "　　[** 毎日決まった時間に起きる（いつもより夜更かしをしない）]",
        "　　[** 8時間睡眠を心がける]",
        "",
        "[** 2. 運動習慣を取り戻す]",
        " 健康は最大の資本なので良いパフォーマンスを残すためには日々，散歩やジョギング，ハイキング，筋トレ，すべてを同時にこなそうとする必要はないがどれかを継続的に行う",
        " 　[** 起床一時間以内に15～30分のウォーキング（早歩き）を行う．]",
        "",
        "[** 3. 昼は食べ過ぎない]",
        "　血糖値の急激な低下は強烈な眠気を誘発するため，なるべく高カロリーな食べ物やおなか一杯食べすぎないようにする．",
        "　血糖値の上昇を抑える食べ方として，[** サラダ類を先にとると良い]",
        "",
        "",
        ""
      ]
    },
    {
      "title": "皇室と国民との距離",
      "created": 1637328762,
      "updated": 1637329611,
      "id": "6197a7718af610001f1d3f38",
      "lines": [
        "皇室と国民との距離",
        "#メモ #皇室",
        "",
        "[** 「開かれた皇室」とは俗っぽくなるということではない]",
        "　「開かれた皇室」という言葉をメディアでよく聞く。どちらかというと国民に寄り添う、距離感の近い皇室、ということで上皇后陛下の平成の時代からよく使われだした。",
        "　ところが近年「開かれた皇室」は俗っぽさと穢れた世界へと足を踏み入れるような気持がしてならない。その最たる例が眞子さんの結婚である。",
        "　小室圭氏との婚約によりこの4年、金銭問題をはじめあらゆる問題に皇室秋篠宮家は巻き込まれた。",
        "",
        "",
        "　本来、開かれた皇室の真意はGHQによる「国民による皇室の監視」がねらいであった。大東亜戦争のように皇室が戦争利用されることがないように一部の利権に利用されることがなく、国民によって監視されることで戦争利用を防ぐ狙いがあった。しかし現代ではどちらかというとそれをいいようにとらえてあたかも英国の王室のようにスキャンダルは流し、皇室も英国のようにオープンになるべきだと議論する人も居る。",
        "　これは全くのナンセンスな指摘であり、そもそも国の成り立ちが違うことを全く無視している。",
        ""
      ]
    },
    {
      "title": "ソニー",
      "created": 1637172842,
      "updated": 1637176226,
      "id": "61954665fa58a3001d4af262",
      "lines": [
        "ソニー",
        "#就活",
        "希望コース・志望動機",
        "希望コース(第1希望)\t77.R&D WILL",
        "希望コース(第2希望)\t83.R&D(環境認識、物体認識に関するアルゴリズム)【ゲーム】",
        "希望コース(第3希望)\t49.イメージング・センシングシステム開発【イメージセンサー・LSI】",
        "志望動機：",
        "　私がR&D WILLを志望した理由は自身の専門である数理最適化の持つモデリング能力を貴社の研究開発職を通して音楽・映像といったエンターテインメント分野に活かしたいと考えたためです。まず、私のキャリアとして『数学を通して世の中を変える』という目標があります。原点は学部生の時に受講した授業で実社会の問題を関わりの深いサプライチェーンや金融工学における最適投資の問題を定式化から学び、プログラムを実装して定式化された問題を実際に計算機で解くことで、最適な意思決定戦略を得るという数学の力に感動を覚えました。この経験が今でも忘れられず、私のキャリア構成の原動力となっています。しかし、数理最適化は理論研究の広範さとは対照的に応用研究者の担い手が不足しており、まだ理論でとどまっているモデルやアルゴリズムが数多く存在します。特に音楽・映像分野は数理最適化の応用として私の知る限りほとんど見られないため、本インターンシップを通してこうした非構造化データを最適化するための技術的知見を得たいと考えています。さらに、社員の方と積極的に議論を行い、現場でしか得られない研究開発職の肌感も吸収したいと考えています。",
        "",
        "興味/関心のあるカテゴリー：",
        "　1番目 ： ソリューションビジネス／サービス(Solution Business/Service)",
        "　2番目 ： 社会インフラビジネス／サービス(Social Infrastructure Business/Service)",
        "　3番目 ： AI・ロボティクス(AI Robotics)",
        "　関心のある内容と理由\tAITRIOSです。私はもともと現状のAIソリューションにおける力業のようなアプローチは、膨大な電力消費の問題や実装の重さといったランニングコストの側面で疑問に感じていました。貴社のエッジAI技術が普及することで、顧客にとっても提供側にとってもコストを削減する未来志向型の真の意味でスマートな社会に一歩近づくとても意義深いAIプラットフォームだと考えます。",
        "",
        "スキル・経験：",
        "開発・言語ツール\tC",
        "C++",
        "HTML/CSS",
        "JavaScript",
        "MATLAB",
        "Python",
        "Linux",
        "AI系ライブラリ（TensorFlow, Pytorchなど）／Library software for AI (e.g. TensorFlow, Pytorch)",
        "プロトタイピング環境（Arduino, Raspberry Piなど）／Development board (e.g. Arduino, Rasberry Pi)",
        "開発言語・ツール（詳細）\tC:大学の必修講義と組み込みソフトウェアでの開発経験（4年）",
        "C++: 組み込みソフトウェア開発経験＆競技プログラミングの経験（半年弱）",
        "HTML/CSS、JavaScript: ウェブサイト作成の際に使用している（2年弱）",
        "Python: 現在の課程で主に数値実験等で用いている（2年弱）",
        "AI系ライブラリ:TFは画像認識系のプログラムを動作させる際に使用（半年弱）",
        "使用経験のある計測/実験機器や上記記載以外の開発言語・ツール",
        "（電気計測器・光計測器、製造装置など）\t",
        "使用経験のある計測/実験機器や開発言語・ツール",
        "（詳細）\t",
        "専門性",
        "専門性（テーマ概要）",
        "　私の所属する数理工学という分野は工学で利用されるような数理モデルの開発やそのモデルの理論的性質の解明などを行う、いわば応用研究（工学）と基礎研究（理学）を結ぶ中間に位置する分野です。特に私の研究テーマである数理最適化は実社会の様々な課題を数式を用いて定式化を行い、ある制約条件のもとで関数を最小化（最大化）するような「最適化問題」という数理モデルを対象としています。一見世間とはかけ離れた問題を考えている気がしますが、最適化問題は近年盛んに研究されている機械学習分野では欠かすことのできない概念となっており、陰の立役者的存在です。そのほかにもミクロ経済学の消費者・企業行動分析や金融工学のポートフォリオ選択問題、オプションの最適停止問題など枚挙に暇がありません。私が特に研究しているテーマは均衡問題です。均衡問題とは最適化問題よりも広いクラスで、複数のエージェントが最適化問題を解くような状況で互いにとって最適な状態となるような「均衡状態」を見つける問題のことを言います。均衡問題はゲーム理論や強化学習、交通工学などで活躍していますが、最適化問題と比較してまだ十分に研究が進んでいない現状にあります。",
        "研究内容：",
        "　私は「不確実性の下での均衡問題」を主なテーマにしています。例えば、将来にならないと知ることができない需要や天候に関するパラメータが含まれた状況で均衡状態を知りたいということが考えらます。このような不確実性を含んだモデルで考慮しなければならない重要な概念はリスクに対する頑健さです。つまり、そのモデルで得られた解が外れ値に対して大きくシステムのパフォーマンスを損なわない頑健さを有するかが重要です。従来研究されてきた均衡問題は専ら確率分布が既知であることを前提としていました。しかし、実社会では確率分布さえ特定できないことがしばしばあるため、分布不確実の下でリスクへの頑健性も兼ね備えた均衡問題の研究の確立が必要とされてきました。私はこの課題に対して最適化問題で提案されている分布的ロバスト最適化と残差最小化という２つのアイデアを融合させた新しいモデルを考えました。さらに、提案したモデルは膨大なサンプル近似による計算を必要としない高速な求解を可能とするモデルへ変換できることを理論的に示しました。また、数値実験で提案モデルで得られた解が外れ値に対して頑健であることを確かめました。",
        "専門性（カテゴリー）\tその他(Others)",
        "取り組み：",
        "　内容\t私は修士課程、現在を通して研究活動に専念してきました。そして、強みは多分野をまたぐ研究開発において必要な数学リテラシーを有していることです。論理的に問題を分析し、あらゆる数学の理論を駆使することで予想をはるかに凌駕する数値パフォーマンスを改善させた経験は、理論的な知識が実際の問題解決に役立つことを表しています。また、数式に落とし込まれた世界と常に対話を繰り返してきた経験は抽象的なものを相手へ理解できるように説明する能力を鍛えることにもつながりました。実際、私が1年前フリーランスとしてある開発に携わっていたとき、自身の専攻分野とは異なる敵対的生成ネットワークと呼ばれるAIの画像生成モデルの論文調査と実装を任された時がありましたが、開発チーフへの説明やPythonでの実装を行いました。説明力に関しては最近10月に行われたオペレーションズ・リサーチ学会の若手研究者発表会にて優秀発表賞を受賞したことも説明力を証明する一つの実績だと考えています。私は貴社の要素技術に直結する応用研究をしてきたわけではありませんが、今後の新製品の開発などで数学によるモデリング知識はいろんな形で役立つと考えています。",
        ""
      ]
    },
    {
      "title": "志望動機など就職活動の軸",
      "created": 1636944385,
      "updated": 1636950616,
      "id": "6191c9fc24448e001d0c8557",
      "lines": [
        "志望動機など就職活動の軸",
        "#就活 #自己分析 #キャリア",
        "[* 下書き（順番バラバラなので再構成すること）]",
        "",
        "　全体像が見えやすい文章ほど気に入られる（ひとえに文章力の高さが書類審査通過率の高さと比例）．",
        "",
        "[*** 志願先の共通点を見出す（就職活動の軸）]",
        "　会社が違っても部署は概ね共通すると思うので，その共通点を列挙する",
        "",
        "[** 数学を社会に応用する]",
        "　私が大学生のころから実現したいと思っていたことは「無味乾燥な数学を血の通った人間社会へと還元する」仕事をしたいということである",
        "　そのために私はモデリングからそのモデルを計算機で効率よく解くための研究を修士課程，博士課程を通して行ってきた",
        "　理由は大学初年の時に受講した『オペレーションズ・リサーチ概論』である．取り扱う内容自体はそこまで難しいわけでもなく，単純に高校の数学で理解できるような一次関数の制約付き最小化問題をコンピュータを用いて解くことであった．高校までは図を使って手でしか解けなかった問題が計算機（ソルバー）を利用することで大規模な問題も一瞬で解いてくれる",
        "　これがきっかけで，私は数学のモデリング能力と計算機の力を活用して社会のあらゆる問題を解決したいと思うようになった",
        "",
        "[* 数理モデルと実社会の乖離に関する批判について]",
        "",
        "[** 研究の経験をどう生かしたいのか？]",
        "",
        "[** 社会に応用した先に何が待っている？]",
        "　私の研究してきた数理最適化は分野をまたいだ基礎的な学術分野である",
        "　この研究経験を生かして",
        "",
        "[** アカデミアでなく企業就職を志望する理由]",
        "　インターンが決まってからでないと中々真の理由は出てこない",
        "　正直今のところ，アカデミアの道の不安定さに内心逃げ道を作っているような状況",
        "　アカデミアも捨てがたいけど，企業は企業で安定しているから魅力的という理由",
        "\t しかし，それが伝わってしまうとどこも通らない．でも，嘘を貫き通すのも将来の自分が後悔することを自分はよくわかっている．じゃあ結局自分は何者になりたいのかという問いが自然に生まれてくるが，私は環境を選ばない，とにかく研究者になりたいということになる．",
        "\t 研究者になる道は必ずしもアカデミアだけではない，企業で研究者になることもできる．目標は研究者なのだから，企業かアカデミアかで比較する点は「研究者になれるかどうか」ではない",
        "\t 参考：",
        "\t table:企業かアカデミアか",
        "\t  項目\t企業\tアカデミア",
        "\t  収入4\t◎\t△～〇（大成すれば◎）",
        "\t  キャリア構成3\t〇（成果が出なければ開発へ異動．シビア）\t◎（研究成果が命だが，留学や本の出版など自由）",
        "\t  研究テーマの自由度3\t△（利益に直結かつすぐ成果が出るもの優先）\t◎（科研費の年単位で研究テーマは自分で選択可能）",
        "\t  働き方4\t◎（になりつつある．テレワーク普及などで）\t△（講義の時間帯に合わせる）",
        "\t  人間関係4\t〇（配属先の上司の運．同期など横のネットワークは作りやすい）\t〇（基本フリーだがひとり．構築する機会が少なく能動的に動かないといけない）",
        "\t  福利厚生3\t◎（大体の会社は整っている）\t〇（最低限確保されている，というところ）",
        "\t  出張機会2\t△（リモートが増えて当分はオンライン）\t◎（学会発表などで海外渡航も可能になる）",
        "\t  雑務の少なさ2\t〇（初年度あたりは？）\t△（助教は研究室の雑務処理のほとんどを任される）",
        "\t  異動機会1\t？（会社によるので何とも言えない）\t△（安定したポストに就くまでは多い）",
        "\t  合計点数（重みなし）\t18\t18",
        "\t  重み付き合計\t57\t53",
        "\t\tこの分析で特に両者間で点数の開きがあり，かつ重視すべき点は「収入」「自由度」「働き方」の三つであった",
        "\t\t\t収入：一流の会社に就職すれば安定的に稼ぐことができる",
        "\t\t\t自由度：自分の思い描いた研究，仕事ができるかどうかはその職業に対する効用ややりがいにつながる",
        "\t\t\t働き方：リモートワークを軸としながらも，フレキシブルな対応を可能とする職場を好む",
        "\t\t以上の分析から，[! 企業就職を選択する場合，この三つに特に着眼点を置く]こと",
        "",
        "[*** その会社でないといけない理由]",
        "　就職活動全体としての自分の実現したいことを書いた後に，やはりそれを実現するには貴社が最適であるという形で帰結するのが望ましい",
        "　",
        "",
        ""
      ]
    },
    {
      "title": "エントリーシートテンプレート集",
      "created": 1636945496,
      "updated": 1636945907,
      "id": "6191ce4fa2ec3e001d7de35c",
      "lines": [
        "エントリーシートテンプレート集",
        "#就活 #キャリア #自己分析",
        "",
        "[** 志望動機（基本的な三段構成）]",
        "　志望動機の要約（１００字程度）：",
        "",
        "　内容の説明：",
        "",
        "　まとめ：",
        "",
        "",
        ""
      ]
    },
    {
      "title": "奈良の旅 旅程",
      "created": 1636799882,
      "updated": 1636823460,
      "id": "618f9584a08c74001d899692",
      "lines": [
        "奈良の旅 旅程",
        "#2021年11月",
        "table:旅程",
        "\t時刻\t予定\t費用",
        "\t11:30\t出発\t",
        "\t13:30\t三輪駅\t¥1,560",
        "\t14:00\t大神神社参拝\t\t",
        "\t14:30\t三輪そうめん\t¥1,000",
        "\t15:00\t大鳥居",
        "\t16:00\t箸墓古墳",
        "\t17:00\t檜原神社参拝",
        "\t18:00\t三輪駅",
        "\t20:00\t帰宅\t¥",
        "",
        "　行き：",
        "　\t[（近鉄特急を利用する場合） https://goo.gl/maps/FKjsrrox2gJn9gnN8]",
        "　\t[（JRを利用する場合） https://goo.gl/maps/DZCcCYDhHCkKBm8YA]",
        "　帰り：",
        "　\t[（近鉄特急を利用する場合） https://goo.gl/maps/J4KZCyWkJumQXHpg9]",
        "\t\t[（JRを利用する場合） https://goo.gl/maps/jA1MzAbeZXrcFQvb8]",
        "　近鉄特急を利用する場合は乗り換え回数が一回増え，大和八木から近鉄と急に乗車することになる",
        "　JR線の場合は奈良駅まで各駅停車",
        ""
      ]
    },
    {
      "title": "説明力や言語化する能力など",
      "created": 1636703971,
      "updated": 1636779794,
      "id": "618e1ede439960001f1f829d",
      "lines": [
        "説明力や言語化する能力など",
        "#説明力 #能動的思考 #習慣",
        "",
        "[** 能動的に考えなければ説明力は向上しない]",
        "　あなたが他人に説明する必要がある状況ならば，必ずあなたは頭の中でいうべきことをしっかり言語化して伝えたいことを整理するだろう．",
        "　これと同じように，誰かが説明してくれる状況に甘んじていれば思考停止状態になる．",
        "",
        "[** 積極的に議論に参加する]",
        "　とはいうものの，これまで参加していなかった議論にいきなり参加するのは心理的にハードルの高さを感じるのが常である．",
        "　しかし，うまい議論ができる人はいつも質疑応答をしているためその環境に慣れているのである．",
        "",
        "[** 日頃から思考を口に出してみる]",
        "　なかなか数少ないプレゼンの機会などを考えると，毎日トレーニングする必要がある．",
        "　もやもやっとした抽象的に描かれる頭の中の概念は実際に口に出そうとすることで整理される．",
        "　こうした経験から，黙って考えるのではなく，口を使い，そして紙とペンを使い積極的に外の世界に出してやる．これを繰り返すことで言語化，説明能力は少なくとも下がることはない．",
        "",
        "[** 京大生はなぜ頭の使い方がうまいのか]",
        "　これに関しては今も明白な答えが出せない．イメージ的には自分はすぐ目的の横道に逸れたようなルートを辿ってしまい，目的をいつも見失い，最終的に他の人の何倍も何十倍も遠回りをしてぼやっとした目的にたどり着くイメージだ．こう言ってしまえば「それがわかっているなら，目的を意識して考えればいい」というかもしれないが，それに気付けるのがいつも事後であり，考えている最中は横道にそれているという認識さえ持つことができない．",
        "　ところが京大生は目的を見失わず，的確にその答えを最短で見つける力を学部生のころからすでに有している場合が多い．これには入学してから最も驚かされた点である．知識量ではない，思考力の「格の違い」を感じた瞬間である．",
        "　彼らにどうやったら近づけられるのか，いろいろ自分なりに遠回りをしながら考えてきた．一つ出た答えは「わからないことを把握する能力の高さ」である．単にわからないことを列挙するだけでなく，目標・目的から逆算して何が今の自分に足らないかを分析する速さである．よって，彼らの投じる質問は本質を突いているものが多く，答える側としても何を問うているのかがわかりやすい．",
        "",
        "[* 参考動画：]",
        "[https://www.youtube.com/watch?v=UHDX7n8FBcA]",
        "",
        ""
      ]
    },
    {
      "title": "より先を見る",
      "created": 1636210959,
      "updated": 1636217514,
      "id": "6186990cc60f150022d61437",
      "lines": [
        "より先を見る",
        "#研究の進め方 #研究の指南",
        "",
        "[** プレプリントを積極的に読む]",
        "　今日、Xiaojun Chenさんのウェブサイトを見たらちょうど自分が考えていたようなモデルを取り扱った研究のプレプリントが上げられているのを目にした。ちょっと悔しいところもあるかもしれないが、自分がここまでのレベル（Math. Program.への投稿）にこぎつけられたのかはあまり自信がない。",
        "　というのも、基本的な経験量や知識量の差は引き出しの多さにもつながる話であるから、自分はそこまで複雑な数学を使いこなせるかというと怪しいところがある。",
        "　そう考えると自分のレベルにあった研究テーマ選びをしなければコケることも肝に銘じておきたい。興味で突き進むのも良いが、ある程度は自分のレベルに見合った研究テーマを選ぶことも念頭に置かないといけない。要は時間は待ってくれないし、やっているうちに誰かが投稿してしまうなんてことも最新の研究を追っていれば同じことを考えている研究者も少なからずいるので、十分に起こりうる話である。",
        "",
        "[** 優れた研究者は問題を構築する能力が高い]",
        "　福島先生然り、優れた研究者は「良い問題（＝宝）」を探す能力が高い",
        "　複雑に入り組んだ問題でもなく、シンプルすぎない、ちょうどいい問題設定を見つける能力が高い",
        "　",
        ""
      ]
    },
    {
      "title": "投稿先について",
      "created": 1635849989,
      "updated": 1635850025,
      "id": "6181170165fb2d001e4ac30a",
      "lines": [
        "投稿先について",
        "#数理最適化分野の研究指南（効率よく研究を進めるために） #研究の指南",
        "[** 山下先生の回答]",
        "論文の評価は，掲載論文誌よりも(他の研究者からの)引用数に移行しつつあります．機械学習などの流行りの分野ではarXivの段階で評価され，論文誌に載るころには評価が終わっています．ですから，論文誌のIFやH指標の細かい差を気にしてもあまり意味はないと思います．(JOTAは掲載論文が多く，玉石混交で，玉の論文が引用数を稼いでいるのだと思います．)",
        "まあ，それでもあえて評価すると,",
        "(1) SIOPT, MP > (2) MOR > (3)  COAP, JOTA, OMS, Optimization, Global Optimization > (4) Optimization Letters > (5) PJO, JIMO > (6)  JORSJ >> (圏外) ハゲタカジャーナル",
        "と言ったところでしょうか．",
        "JOTAクラスはたくさんあります．その中でも細かい差はあると思いますが，好みの問題だと思います．",
        "また，査読のレベルと論文誌のレベルが異なることもあります．ＯR学会のJORSJは，国際的な評価は低いですが，査読レベルは(3)～(4)ぐらいのハイレベルです．",
        ""
      ]
    },
    {
      "title": "出雲の旅",
      "created": 1635518361,
      "updated": 1635522633,
      "id": "617c078e097c1c001dac084b",
      "lines": [
        "出雲の旅",
        "#旅行 ",
        "[** 旅の目的]",
        "　出雲大社の参拝を果たし，古事記ゆかりの地をめぐる，いわば真の意味での聖地巡り",
        "[** 旅程]",
        "11月旅行の計画：11月27-28日",
        "京都からは新幹線で岡山まで行き，特急やくもに乗り換えるだけで行ける",
        "行き＞ https://goo.gl/maps/AoBgApcBhnG49gCd6",
        "帰り＞ https://goo.gl/maps/kyFmiEEYgugk6Y4a6",
        "宿＞ 天然温泉　八雲の湯　ドーミーイン出雲（ドーミーイン・御宿野乃　ホテルズグループ） ",
        "",
        "[** 出雲大社参拝]",
        "　出雲大社は「二礼[* 四拍]一礼」",
        "[** 旧大社駅]",
        "",
        "[** 稲佐の浜]",
        "　",
        "　夕日が綺麗な場所なので，夕方に行くと良いらしい",
        "",
        "[** 出雲そば]",
        "　羽根屋の割子そば",
        "",
        "[** 出雲ぜんざい]",
        "　坂根屋",
        "",
        ""
      ]
    },
    {
      "title": "創作・何かを作ること",
      "created": 1633255370,
      "updated": 1635431848,
      "id": "61597fc46f3e84001ea4eb11",
      "lines": [
        "創作・何かを作ること",
        "#ものづくり #創作 #執筆 #作曲 #研究 #研究の進め方 #思考ツール",
        "[** 全体像をしっかり固めること]",
        "　さあものを作ろう、何か書こうとなったとき、全体像やそれを決める核心がブレていると",
        "　花の刺繍を作るときに、何処から刺すのが良いのかという話で、花の真ん中となるとなる花弁の中心から刺すことで核心をブレないようにする。これは絵においても同じことが言えよう。核心を突く部分を先に構築しなければ、全体像はボヤっとしてしまう。",
        "",
        "[** 細部から固めようとしない]",
        "　先と同じことを言い換えただけだが、それほど作品に対する俯瞰的立場を忘れてはならないことを強調しなければならない。何を作っているのかわからなくなったら、その作品は[! 誰にも届かない]。そうならないためには、やはり細部から固めよう、という考えは捨てるべきだと考える。",
        "　建物の建築では、まず足場を設置し、建物の骨組みを組み立てなければ、バランスの良い家は立たない。",
        "　これと同じことは作曲にしろ、研究にしろ、クリエイティビティを求められる仕事はすべてに当てはまる。",
        "　そして、全体の骨組みを作り、細かい作業に取り掛かることになったとしても常に俯瞰を忘れてはいけない。今行っている作業は全体においてどこを担っているのか？（どこの部屋、どこの設備を作っているのか）さらに、問い詰めれば、その作業によってできる一部分というのは本当に作り上げようとしている全体にとって必要かどうか？このようなすべきことの取捨選択を一段深く入るたびによく考えなくてはならない。",
        "",
        "[** なぜこれほど全体像に拘るのか]",
        "　これほど、通説に全体像の重要さを訴えるわけは、これまでに私が仕事や論文作成などで不必要な作業をたくさんしてきてしまった後悔にある。あのとき一度引いて考えていれば、あんな行動はしなかったのにな、と今になって考えることが山ほどある。そして、どうして自分だけ他の人よりも時間かけてこれだけしか成果が出ないのか、とたくさん悩んできたからである。",
        "　しかし、世間を良く観察してみると無駄と指摘されることは国家の政策レベルでも行われていたりする（例えば、アベノマスクやレジ袋の有料化）。本当に必要なことだけをあらかじめ取捨選択できるのはおそらく神様しかいないと思うが、たった一度の人生無駄を最小化したいものである。やってみないと「無駄だ」と気づけないことの方がたくさんあるのも確かである。ある程度考えてもやっぱりやるべきかわからなければ、勇気を出して踏み出してみるほうが良いと考える。",
        "　再度、『イシューからはじめよ』をリマインドしておくが、これもこれで頭では分かっていても、なかなか実践が難しいと感じさせられる。やるべきことを選別する思考のテクニックというのは、これもこれで一朝一夕で身につくものでない。",
        "",
        "[** 核心を明らかにするにはどうしたらよいのか？]",
        "　ひとつにやはり経験の多さであろう。いきなり本質をとらえることはまずルーキーには難しい。しかし、経験の多さというのは時に本質を曇らせることも我々は良く知っている。",
        "　これについてはまだ自分はよくわからない。",
        "",
        "[** 地図の作成は全体像を把握する強力な手がかり]",
        "　イメージのマッピングはそれまで調べてきた物事同士の関係を明らかにしたり，全体像を理解するのにとても役立つ",
        "　どこか詰まっている時は大抵自分がどこにいるのかわかっていないときだ．まさに地図を持たずに森に入って迷ったことと変わらない",
        "　迷い込んで右往左往してまた戻って来るタイムロスを少なくするためには自分がたどってきた道を記録すること．つまり道しるべとなるものを一定間隔で立てておく．これは日報だったりとにかく[* その日やったことを記録する]ことに相当するだろう",
        "　そしてそれを二次元のマップとしてより具体的な形にして単なるリストの羅列を項目ごとの関係性を紐づけるのである",
        "　こうすることで「あれ？ここはどうなんだろうか？」といった[* 筋の通った]新しい問いが初めて生まれる",
        ""
      ]
    },
    {
      "title": "祈り方が9割",
      "created": 1634477912,
      "updated": 1635173267,
      "id": "616c2752ae1ce6001db7fa68",
      "lines": [
        "祈り方が9割",
        "#読書メモ #神社 #神道 ",
        "[https://scrapbox.io/files/616c27c073b4fc001d8e3c7b.png]",
        "[** ]",
        ""
      ]
    },
    {
      "title": "自己紹介（日本語）",
      "created": 1620839061,
      "updated": 1634026590,
      "id": "609c0a92380b3a00226f63df",
      "lines": [
        "自己紹介（日本語）",
        "#就活 #キャリア #自己分析",
        "",
        "[** なぜ博士課程を経て就職活動をするのか？]",
        "",
        "",
        "[** 博士課程は自分の至らなさ，本当に社会で必要な基礎能力を再確認する場]",
        ""
      ]
    },
    {
      "title": "2021年9月の目標＆フィードバック",
      "created": 1630467816,
      "updated": 1632934688,
      "id": "612ef6e6b356d00020b712b0",
      "lines": [
        "2021年9月の目標＆フィードバック",
        "#予定 #計画 #生活習慣",
        "",
        "[**** 目標]",
        "",
        "一か月後，私は...",
        "",
        "[*** 研究]",
        "[** 1. 論文を完成させている]",
        " §3.2が終了しなかった → 第一週で先生に提出するまで終える",
        " [- §2.2 までの修正：]",
        " 　[- 証明の具体化（コメント通り）]",
        " 　[- 冠詞をとる（例：the problem (13) → problem (13)）]",
        "　残りはその修正が戻ってから適宜計画を立てる",
        "",
        "[- 2. PHMが擬単調に拡張できるかどうかを検討する] ⇒ ひとまず保留",
        "　いまだに不明 → 近接点法の部分をEG法にしたら動きはするだろうか？ちょっとわからないし，うまくいきそうか不安なのでこれ以上リスクを負わないために確実に進められるものへと変更する．⇒ 研究として確実に遂行できる，または大幅な修正が必要かどうかを明確にする",
        "",
        "[** 3. 二段階分布的ロバスト変分不等式問題に対する期待残差最小化を提案している]",
        "　Chen and Jie (2017) が提案した正則化ギャップ関数によるERMを考える代わりに Chen et al. (2012) で提案したメリット関数を用いて二段階分布的ロバスト変分不等式に対するERMを考えられないだろうか？",
        "　この関数を用いるメリットとしては凸性の条件が正則化ギャップ関数よりも緩くなることがある（計算としては少し面倒だが）",
        "",
        "[- 4. 変分不等式問題に対するスパース解の構成方法についてなぜ]",
        " [- 過去に研究室の修士学生が取り組んでいたものを非線形や一般の凸集合に拡張させたものを提案する]",
        " [- なぜまだ変分不等式への拡張が思うように進んでいないのか明らかにする．]",
        "",
        "[*** その他の勉強]",
        "[** 1. Kaggle のチュートリアルを完了している]",
        " 完了（9月10日）",
        " Intermediate 終了",
        " 開催中のコンペに参加する",
        "",
        "[** 2. Kaggle本2章を読み終えている]",
        " ほんの少し最後の部分を残した状態",
        "",
        "[** 3. 『イシューからはじめよ』第3章を読み終えている]",
        "　全く",
        "",
        "[** 4. 3の内容をscrapboxにまとめられている]",
        "　全く",
        "",
        "[** 5. TOEIC の勉強を始めている]",
        "　毎日10分リスニング問題を解く",
        "　毎日10分リーディング問題を解く",
        "　毎日5分英単語を勉強する",
        "　\tキクタン本ベースで進まないなら，その単語をiKnow!に登録して勉強しやすくするなど工夫をする",
        "",
        "[** 6. TOEIC の申し込みを終えている]",
        "",
        "[*** 生活習慣]",
        "[** 1. 睡眠習慣の固定化]",
        "　先月は全く手に付けられなかった．無理に朝方にシフトする必要はない．正直，夜中の2時くらいに寝て10時から10時30分くらいまで起きるくらいがちょうど自分が求めている睡眠の快感が得られる．まずは以下の二点を達成できるように行動する．",
        "　　[** 毎日決まった時間に起きる（いつもより夜更かしをしない）]",
        "　　[** 8時間睡眠を心がける]",
        "",
        "[** 2. 運動習慣を取り戻す]",
        " 健康は最大の資本なので良いパフォーマンスを残すためには日々，散歩やジョギング，ハイキング，筋トレ，すべてを同時にこなそうとする必要はないがどれかを継続的に行う",
        " 　[** 起床一時間以内に15～30分のウォーキング（早歩き）を行う．]",
        "",
        "[** 3. 昼は食べ過ぎない]",
        "　血糖値の急激な低下は強烈な眠気を誘発するため，なるべく高カロリーな食べ物やおなか一杯食べすぎないようにする．",
        "　血糖値の上昇を抑える食べ方として，[** サラダ類を先にとると良い]",
        "",
        "",
        ""
      ]
    },
    {
      "title": "論文を効率よく読むために気を付けること",
      "created": 1632835428,
      "updated": 1632835674,
      "id": "6153175454991f0023eb7d15",
      "lines": [
        "論文を効率よく読むために気を付けること",
        "#イシュードリブン #研究 #研究の進め方 #サーベイ #論文",
        "",
        "[** 読む前に仮説を立てておく]",
        "　これは読もうとしている論文で自分が得られると期待する情報を仮説形式で立てておく。例えば、現在行っているような不確実性の下での数理最適化を例にとると、「この最適化モデルは過去の同列の研究と比較して頑健である」などである",
        ""
      ]
    },
    {
      "title": "考える技術・書く技術",
      "created": 1632563207,
      "updated": 1632753333,
      "id": "614eeff8b74e83001f4b1138",
      "lines": [
        "考える技術・書く技術",
        "#読書 #書き方",
        "[https://scrapbox.io/files/614ef04bf8394d00230daa69.png]",
        "",
        "[*** ピラミッド構造の鉄則]",
        "[** 1. どのレベルであれ、メッセージはその下位グループ群を要約するものであること]",
        "[** 2. 各グループ内のメッセージは、常に同じ種類のものであること]",
        "[** 3. 各グループ内のメッセージは、常に論理的に順序付けられていること]",
        "",
        "[** 「いったん書き上げてみる」は禁忌]",
        "　いったん書き終わってしまうと直すのが大変でなかなか心理的に直さない傾向にあるため",
        "",
        "[** 文章で伝えること＝ピラミッドの構築が如何にしやすいか]",
        "　「マジックナンバー7±2」と呼ばれる人の短期記憶の限界個数がある。通常、人は何かを記憶するとき、グループ化や要約といったプロセスを経る。例えば、りんご、牛乳、チョコレート、ぶどう、チーズ、ポッキー、なし、という羅列があった時、自然とりんご・ぶどう・なしで「果物」というカテゴリーを作り、牛乳とチーズで「乳製品」、チョコレートとポッキーで「お菓子」という分類を行うことで頭の中を整理する。つまり、知的プロセスとはグループ化と要約と言っても過言でない。",
        "[https://scrapbox.io/files/614ef2b3e7faad0020657bb2.png]",
        "",
        "　文章は上記の例ほど簡単に名詞で片付けられるものではないが、上のような構成を容易に構築できるものでなくてはならない。しかし、なぜ我々はこの書くという作業にこれだけ悩まされるのか？",
        "",
        "[** 文章を書くまでのプロセスと読み手の求めるプロセスは異なる]",
        "　実際、何かを書くためにアイデアを練っているとき、我々は小さな事例などを頭に思い浮かべてそれを統合するプロセスで考えている。これは書く前に自分の考えを明確に認識している人はいないからである。というより、むしろ書くというプロセスを経て書き手は自分の考えを認識するといってもよい。",
        "　やがて、統合するプロセスを積み重ねて一つの考え（タイトルなど）にたどり着く。すべての文書は、常にただ一つの考えをサポートするようなピラミッド構成になる。",
        "",
        "[** まず全体を要約する考えを述べ、そのあとに個々の考えを一つ一つ説明する]",
        "　例えばこんな風に説明されたらあなたはどう感じるか？",
        "　　先週チューリッヒに言ったのです……ご存じでしょうが、チューリッヒという町はとても保守的なところなのですよ……それで、レストランのテラスで昼食をとっていたのです。驚きましたよ。たった15分の間に、口髭や顎鬚を生やしている人を15人も見たのですから。",
        "　　もちろん、ニューヨークではどこのオフィスでも口髭やもみあげを濃くした人を見ない方が珍しいでしょう。",
        "　　もちろん、ひげを生やすなんてことは、ロンドンでは10年以上前から珍しいことではなかったわ。",
        "　主張したいことが何なのか汲み取るまで、個々の場合をいくつか聞かないと納得できないだろう。よって、聞き手はストレスを感じる。これは情報が耳に入ってくるたびに関連付け体系づけて理解しようとするため、論理の筋が見えないときほど自然に人は推論をはたらかす方にエネルギーを用いる。",
        "　一方、以下のように説明したらどうだろうか。",
        "　　ビジネス社会でここまで髭が容認されているなんて本当に驚きですよ。",
        "　　チューリッヒでも……",
        "　　ニューヨークでも……",
        "　　もちろんロンドンでも……",
        "　先に主張したいことが述べられているから、聞き手は理解しやすく、スムーズに話の流れに乗れる。",
        "　自分の考えを間違いなく伝えるためには、前もってその道筋を伝え、理解の枠組みを自分のものと同じにしてもらう。こうすることで、それぞれの事柄の関連性を誤解されてしまったり、何も伝わらない事態を回避できる。",
        "",
        "",
        ""
      ]
    },
    {
      "title": "最近の心身状態に関して",
      "created": 1632679373,
      "updated": 1632728850,
      "id": "6150b5c1edb86100201d8d87",
      "lines": [
        "最近の心身状態に関して",
        "#体調 #健康管理 #20210927",
        "[** これと言って打ち込めるものがない（研究を含めて）]",
        "",
        "[** 集中力が持ちにくくなった]",
        "",
        "[** 本の内容、学ぼうとしている内容がなかなか頭に定着しにくくなってきて勉強するのが辛い]",
        "",
        "[** 散歩の習慣はある程度設けているが鬱っぽい日がほとんど]",
        "",
        "[** 頭がぼーっとするし、聞かれていることが理解できないことがある]",
        "",
        "[** 頭の中がグチャグチャしてて整理できないことが多くなり、考えることを放棄したくなることが多くなった]",
        "",
        "[** これまで1の労力でできていたことが3, 4倍以上かかるようになった]",
        "",
        "[** 何よりも話す機会が無いため、投薬治療によって根本的に治癒できるとは期待できない]",
        "",
        "[** 何もやる気がないので、スマホでYouTube動画を見る癖が治らない（治したいけど治らない）]",
        "",
        "[** 社交性不安かもしれない]",
        "　連絡するのに若干恐怖心を抱いてしまい，注意不足でまた怒られるんじゃないかとおびえてしまう．",
        "　相談の心理的ハードルがとても高い",
        ""
      ]
    },
    {
      "title": "身のためになる読書術",
      "created": 1632400909,
      "updated": 1632564640,
      "id": "614c760aade2e8001da1a07b",
      "lines": [
        "身のためになる読書術",
        "#読書 #本 #学習",
        "",
        "[** 目的と締め切りを決める]",
        "",
        "[** 買った当日にすぐ目次を熟読する]",
        "",
        "[** キーワードを拾う]",
        "　読書を通して理解することは何もいきなり自分の文章でまとめることを必要としているわけではない。読書で最も重要なのはその本で用いられている重要なキーワードを拾うことである。",
        "　「考える技術・書く技術」で書かれているように、記憶はピラミッド構造によってなされる方がはるかに負担が少ないのである。つまり、ピラミッドの上部ほどその本の主張を特徴づける重要なキーワードが現れる可能性が高い。そのため、まずは各節、各章で述べられているテーマを一文、もしくは名詞句で簡潔にまとめておく。",
        "　最終的に本の主張をピラミッドでまとめられれば十分なのである。特に上部を抑えておけば、それに従ってルートを思い出すことは比較的容易になる。",
        ""
      ]
    },
    {
      "title": "論文作成の技術",
      "created": 1616651919,
      "updated": 1632393509,
      "id": "605c268267a1fb001c5a64bd",
      "lines": [
        "論文作成の技術",
        "#論文作成 #研究 #EnglishWriting",
        "",
        "[*** 1. 常日頃成果をまとめる（重要）]",
        "　いつも進捗を日本語でまとめておくことで、いざ論文を書くときに時間がとられない。また、定期的に振り返り頭の中を整理するいい機会である。このとき、すらすらかける必要はなく、いかに頭の中を整理するかが重要である。",
        "　[* 下調べもここでよくしておく]。論文執筆を始めたときにサーベイをするような逆行作業をすると、明らかに研究としてのモチベーションが弱いものになってしまう。自分の研究の立ち位置は研究しながらしっかりと固めておく。つまり、先行研究の Pro/Con をしっかりとまとめておき（ここ⇒[/Keith326PaperReview]）、なぜ自分の研究テーマは掘り下げる価値があるのかをしっかり説明できるようにしておく。",
        "　早く論文を書いてしまいたい、という[* 焦りは禁物]。ここでどれだけ固められるかが研究の価値を決めるといっても過言でない。",
        "",
        "[*** 2. アウトライン構成を行う]",
        "[** 2.1. アウトライン構成の重要さ]",
        "　いきなり書き始めると、あとで自己添削するときや先生に見てもらうときに大幅な修正をする羽目になり、結局一から書き直すなんてことがざらにあるので、まずはどんな構成で論文を書くのかしっかりと固めておく。",
        "　また，1で日頃まとめたものをそのまま論文として作成すると，まだ完成していないメモを貼り付けたような管制官になってしまうので，あくまでも論文は論文として一からアウトラインを考えること．そして，この時に読者にとっての最適な論理構成を意識する．研究を進めていく順序と論文としてまとめた時の理路整然は別の話．やったことを順番に書けばいいってものではなく，最終的に伝えたいことと論理の全体像を意識して構成を練る必要がある．",
        "[** 2.2. 目的と読者を定める]",
        "　その研究はどんな貢献をしたのか、そしてどんな人に読んでほしいのかを想定する。たとえば、均衡問題に関する研究なら、どんな実務家がこの論文に興味を持つのかを思い浮かべてみるとよい。また、その人たちに説明するときに不測のない説明になっているかアウトラインを再度確認する。",
        "[** 2.3 演繹的記述は避ける]",
        "　『考える技術・書く技術』（バーバラ・ミント著）の第五章で述べられているが、演繹的理由付けによる記述ではなく、帰納的理由付けによる記述を行うことである。",
        "　つまり、我々の問題解決を提案するに至るまでに考えるプロセス（論理構造）と読み手にとってわかりやすい論理構造は逆になる。",
        "　演繹的理由付けによる論述は小説のように一本の矢印によって話が展開されていくが、帰納的理由付けによる論述は先に最も主張したい事柄を述べた後にそれを裏付ける（もしくは実現するための）要素をツリーのように配分する。",
        "　これによって、読者が主張を読むまでに覚えておかなければならない事が減るため、ストレスを軽減させる「読みやすい」文章へと変化する。",
        "",
        "[*** 3. 日本語でまず書いてみる]",
        "　まだ英語で書き始めるには実力（語彙力、表現力）が足らないので、まず一通り日本語の論文を作成する。このとき、英語では気づけない点がある。例えば、[* 論理の跳躍や表現のあいまいさなど細かい点に気を配っておくほどのちの英語論文作成で添削する幅が減る]。つまり、基本的にステップ1からやっている作業はスコープを絞っていく作業であり、スコープを絞った分解像度を上げて内容を詳らかにすることになる。",
        "　このとき、TeXのソースコードで直接構成を考えながら書いているとどうしても局所的になってしまい、全体的な流れを無視した近視眼的な文書になりがちなので、まずはメモ帳やワード（場合によっては手書きでもよい）といったパッと見たときに余計なマークアップ記述が読むのを邪魔せず、すらすらと読めるようなエディタで文章を書き始めるとよい。数式に関してはこのときは書かなくてよくて、全体の流れを決めるために行う作業を意識して細部にのめりこまないようにする。",
        "",
        "[*** 4. 英語論文の作成]",
        "　日本語の論文でほぼ型はできているとは言いつつも、英語論文の作成は思ったよりタフである。まず直訳として書いてしまうと、日本語独特の表現（婉曲、指示語表現、単語の重複）などが残っている可能性があるため成立しない事が多い。",
        "　そのため、英語表現は様々な文献の表現を飲み込んでいき、実力を上げるほか今はない。そこの部分は教員の指導を仰いでも問題ないと思う。しかし、文法のミスや単語表現のミスなど翻訳機で掛けたときに明らかに間違った意味で使われているようなことは教員に見てもらう前に避けねばならないことである。",
        "　初めに日本語で書いた原稿を参考に英訳文を書いていく。このとき、あまり表現の冗長さを回避するための表現をあまり考え込まないほうがいい。いずれ直すところであるが、まずは一通り完成させることが重要である。",
        "",
        "[*** 5. 添削は寝かせてから]",
        "　さて，英語論文を作成し終えてから共著者（先生）にチェックしてもらう前に添削作業に入るが，仕上げてすぐに添削作業に入るとどうしても先入観が抜けない問題に遭遇する．そのため，数日たって読み直してみると明らかに論理の跳躍があったり，誤字にさえも気づかない時があったりし，読者の目線というのが損なわれやすい．余裕のある論文作成を心掛け，添削する際はニュートラルな視点で読めるよう，数日寝かせた方がよい．",
        "",
        "[** まとめ：標語として伝えたいこと]",
        "[*** 1. 研究の目的を見失わないこと]",
        "[*** 2. 全体像を見失わないこと]",
        "[*** 3. 細部は後から考え，初めから詰めようとしないこと]",
        ""
      ]
    },
    {
      "title": "吃音 - 伝えられないもどかしさ",
      "created": 1631756626,
      "updated": 1631811617,
      "id": "6142a14e1edfa60022fee246",
      "lines": [
        "吃音 - 伝えられないもどかしさ",
        "#読書メモ #吃音",
        "[https://scrapbox.io/files/614378029725520023f3f2ca.png]",
        "",
        "[** 吃音はこの100年で様々なアプローチで研究されてきたがまだ明らかでないことが多い]",
        "　日本では110年ほど前に「吃りは真似をするからそれが癖になる」という説が信じられていた。",
        "　その後、吃音を指摘するから当人がそれをより意識して発生に障害が起きるという説が提唱された（診断起因説）",
        "　　提唱者のジョンソンは実際幼年期に先生などに喋り方に関して指摘され始めてから吃音が重くなった経験がある",
        "　　彼は実際にその後「モンスタースタディ」と呼ばれる、現代の倫理観では受け入れられない実験を行なった。",
        "　　　被験者の子供は親などに喋り方を執拗に指摘されるような環境に置かれたら実際に吃音症になるかというものだった。その実験によって吃音症になるというデータは得られなかったが、一方で被験者たちはその後の人生において重い精神障害を抱えるような深刻な問題へと発展した。",
        "　　　その後2000年代に入ってその実験が世間に明るみになってジョンソン博士が当時在籍していたアイオワ大学は謝罪、被験者へ慰謝料を支払うまで発展",
        "　現在ではある4つの遺伝子の変異が吃音と関係があると信じられている。ある吃音者には共通して、その4つの遺伝子の変異が見られるという研究結果を示した。しかし、その傾向が見られるのは全体の吃音者の10%強ほどであるため、一般的な結果を裏付ける説にはなり得ない。",
        ""
      ]
    },
    {
      "title": "共有欲を満たすために学び、研究する",
      "created": 1631439715,
      "updated": 1631442567,
      "id": "613dcb5a410f6e001d9ad349",
      "lines": [
        "共有欲を満たすために学び、研究する",
        "#勉強 #考え方 #研究 #学習",
        "",
        "[** 進学したきっかけとギャップ：「ああ、これからは一人で面倒を見ないとついていけない」]",
        "　最近になってようやく何のために研究をしているのかと考えるようになった。正直入学前までは、興味があるから深めてみたいという一心であった。しかし、現在のような状況になって人と考えを共有する機会が減ったことは、改めて学ぶ意義を考え直すきっかけになった。",
        "　自分にとっては数少ない研究室の学生に数学的な知識などを共有し、モデルの精度を上げたり、分からない部分を一緒に解決するなど、相互に教え合う環境が好きだった。",
        "　パンデミックに入ろうと入らなかろうと、博士課程に入れば遅かれ早かれ、修士のようなペースでやる研究の延長線でないことに気付いていたと思う。何せ、こんな状況でも、周りは賢く立ち回りし着実に成果を残しているわけである。",
        "",
        "[** 学んだことをまとめないのはもったいないこと]",
        "　そうした事情があるため、自分の研究や一人で勉強をつづける動機をより強くし、楽しくなるために工夫しようと思った。",
        "　最近は書評や自分の専攻で学ぶ内容をブログやYouTubeなどに上げて自分の好きなことを通して人に共有することが盛んに行われている。そこには、自分なりのオリジナリティを含めたクリエイティビティを含めることでより読者（視聴者）はそのコンテンツを面白く試聴できる。",
        "　つまり、見聞きしたことを自分の言葉や感性で伝えるというコミュニケーションの礎のようなものが今最も価値をもつと思う。",
        "",
        "[** 研究になると話は変わる]",
        "　研究となると、研究テーマのアイデア勝負の側面があり、なかなか面白さを伝えることは難しい。それにどれだけ自分が面白いと思っていてもそれが世の中に必要でないと判断されたら、全くパトロンはついてこないため、共有欲といったものも一向に満たされないだろう。",
        "　そのため、研究はテーマ選びがとても重要になってくる。世の中が興味深いと思うものは案外実現するのが容易いものでなく、多くの人出を借りなければ成功しない。",
        "　こうしたシビアな環境のなかうまくやっていくためにはやはり研究者の仲を専門内外に作ることだと思う。それはまさに修士の時に感じていた考えを共有できる人がいるかどうかという問題になる。"
      ]
    },
    {
      "title": "数学書や論文を読むとき",
      "created": 1630656950,
      "updated": 1630657477,
      "id": "6131d9af16b3fa0022a31538",
      "lines": [
        "数学書や論文を読むとき",
        "#勉強 #研究",
        "",
        "[** 証明は筆者が思いついた順序で書かれているわけでない]",
        "　実際に今の論文を書いていて直される最大の点は「読者にとっての読みやすさ」である。自分の研究では逆の順番で十分条件が後になって出てくるという形で話を展開させてきたが、いざ証明になると読者は命題として十分条件を先に仮定することで必要性を示す流れのほうが分かりやすい。必ずしも頭で描いてきたことが一般の読者にとって理解しやすい順序とは限らない。忘れてはならないのは一般的な読者の認知を想像することである。",
        "",
        "[** 概念、定義、定理はいい意味で淡々と読む]",
        "　数学書を読むとき「なぜこんなことをいきなり考えるんだ？」とか、「どうしてこうなるのか？」といったいわゆる[* 行間]の疑問が生まれる。例えば数式の変形などでどうしてこうなるのか？と考えるのはある程度は必要だと思うが、そもそも数学書で紹介する概念に関して、「いきなり何でこんなこと考えるんだ？」といった疑問は正直、数学を高い視点で眺められるだけの知識と経験がないとわからないもの。",
        "　私は関数解析を勉強したとき、線形代数で考えていた概念に関して何でこんなことを考えるのかが解消されるという経験をした。",
        "　つまり、誤解を恐れずに言うなら一度は概念を鵜呑みにする勇気は物事を進めるうえで必要であるということ。長年理学部の講義や教授お墨付きの名著であれば、そこは全身委ねてもいいと思う。",
        ""
      ]
    },
    {
      "title": "毎日書く",
      "created": 1630580812,
      "updated": 1630586624,
      "id": "6130b03a5b4408001d61b46d",
      "lines": [
        "毎日書く",
        "#研究 #学習 #勉強",
        "",
        "[** 頭で考えるだけでなく，書いてまとめる習慣を]",
        "　ここ数日論文の修正に大幅に拍車をかけるようになったり，質問を投稿したりと言葉で考えていることをきちっとまとめる機会が多くなって頭の中が少しずつクリアになってきている．",
        "　本来，これまでにそれを毎日やっていなければならなかったが，すっかり怠っていたといえる．",
        "　頭で考えていることはいざ紙に書き起こしてみると，意外とうまくいかなかったり180度全く異なる知見を得ることもある．また，書き起こすことによっていったんそのことを頭から外してさらに深い層に掘り下げられたり，違う視点からものを見られるという利点があると思う．これは自身の直感的な経験を記述しているにすぎないが．",
        "　論文作成術の本にも書いてあった通り，毎日の少しずつ書くというスタイルは論文をコンスタントなスピードで仕上げるための最大の技だ．書くのが嫌であっても毎日決まった時間にエディタを開くようにする．",
        "",
        "[** Trello などの進捗管理アプリに逐一メモを残す]",
        "　今日行ったことや学んだことを振り返るには，ToDoリストをあらかじめ作成しておいてその日の終わりにフィードバックや新たな知見をきっちり言語化して残すことがいい",
        "",
        "[** 書き写しにならないための数学ノートの取り方]",
        "　一説によると，（比較対象がまるで別次元だが）小平邦彦は最初は数学書を写経するように写したのち，その証明などと対話を重ね，その数学所の欠点を炙り出しながら完璧な証明を作る．その作業はまるで新たな本を作り上げるかの如く幾度もノートをアップデートしていったらしい．そうして，最終的には原書の何倍もの分厚いノートを作ることで数学的概念を一生モノの血肉としていたらしい．",
        "　ここまでの次元は求めないにしろ，ある程度自分で理解するためには定義をそのまま書き写すことは大事である．しかし，これも[* チャンク]という概念を忘れてしまうと，断片断片を理解しないまま丸写しすることになるため，時間の無駄となってしまう．",
        "　ある程度読み進めたらノートをとる．例えば，一つの定義をしっかり理解して読み終えたら，記憶を頼りに自分の言葉で書いてみる．そして，本の定義と見比べる．不足しているところはしっかりと書き足し，冗長なところや誤解を招く表現は修正する．逆に本のほうがいい加減という場合は（自分の本であれば）本に直接補足を書く．",
        ""
      ]
    },
    {
      "title": "[自己分析] 就活直前の自分はどうなっていたいのか",
      "created": 1630472544,
      "updated": 1630474224,
      "id": "612f095f1ea5e3001da88c2c",
      "lines": [
        "[自己分析] 就活直前の自分はどうなっていたいのか",
        "[** 退職して博士課程で何を得たのかがはっきり言えることが何よりも大事]",
        "正直，今のところパッと答えられないので何か目標をもって取り組むことが必要だ．",
        "",
        "[** 1. 自分で課題を見つけ，自分で計画を立て，自分で調べ，自分で解決する力]",
        "時間は人一倍かかったが，研究遂行能力を養うことができた．",
        "もちろん，原稿の修正や数学的に不明な点などわからないところはどんな基礎的なことでも質問するように心掛けた．",
        "",
        "[** 2. ]",
        "",
        "[** 研究以外にどんな能力をアピールするか？]",
        "世間は研究ばかりしている人を採りたいとは思わない．どちらかというと文武両道系やアウトリーチといったことにも精力的な人材が特に好まれる傾向にある．",
        " TOEIC の点数（ここから800点以上を目指す）",
        " Kaggle コンペの経験（銅を一回とることを目標にする ⇒ 同コンペ参加者とのチームワーク経験）",
        " SUSLABでのデータ解析経験（Kaggleに通ずるような分析技術の育成に繋げられないか？）",
        " 趣味など：音楽（作曲），芸術 ⇒ 今度の映像作品でなにか音楽の面で携われないか？",
        "",
        "この三つを真剣に取り組めば，何か自分の確固たる共通項が見えてくるはず．",
        "逆にこれ以上多くのことに取り組もうとすると多分崩壊する．自分はマルチタスクがそもそも向いていないと思うので．",
        ""
      ]
    },
    {
      "title": "2021年8月の目標＆フィードバック",
      "created": 1630413915,
      "updated": 1630467889,
      "id": "612e2458cd59bf001d92fdb4",
      "lines": [
        "2021年8月の目標＆フィードバック",
        "#予定 #計画 #生活習慣",
        "",
        "※ 先週ごろ立てた今月の目標",
        "",
        "[*** 研究]",
        "[** 1. 論文執筆を最後まで終わらせる（修正までは良い）]",
        " §3.2が終了しなかった",
        "",
        "[** 2. PHMが擬単調に拡張できるかどうかを検討する]",
        "　いまだに不明 → 近接点法の部分をEG法にしたら動きはするだろう",
        "",
        "[*** その他の勉強]",
        "[** 1. Kaggle のチュートリアルを完了する]",
        " やってない",
        "",
        "[** 2. Kaggle本1章をざっと読む]",
        " ほんの少し最後の部分を残した状態",
        "",
        "[** 3. イシューからはじめよ2章精読]",
        "　全く",
        "",
        "[** 4. 3の内容をscrapboxにまとめる]",
        "　全く",
        "",
        "[*** 生活習慣]",
        "[** 1. 生活習慣を8時起きまでに戻す]",
        "　全く",
        "",
        "[*** フィードバック点]",
        "　まず目標を立てたのが今月末だったのでほとんど遂行できていない．自分の持ちうる能力だと，大体3週間くらいかかるタスクを１週間でこなそうとしたことに計画の甘さがあった．",
        "　就活時期までにどこを伸ばしたいのか明確にし，行動の取捨選択をそろそろ本格的に考えるべき．今の分はあれがやりたいこれがやりたいが渋滞しているためすべてが中途半端になっている．",
        "　今月から開発の仕事にも戻るわけだから，より自分の研究やその他資格などに避ける時間が限定されてくる．限られて時間で何をすべきなのか「真剣に」考えよう．",
        ""
      ]
    },
    {
      "title": "英作文の技術",
      "created": 1616481960,
      "updated": 1630411194,
      "id": "60598e9eafe8c5002253082f",
      "lines": [
        "英作文の技術",
        "#EnglishWriting #論文作成",
        "",
        "[*** 句読点法 (punctuation)]",
        " [** コロン]",
        " 1. 独立節（independent clause）に続いてリストや説明が続く場合の区切り",
        "\t\t... as follows: i. A ii. B iii. C",
        " [** コンマは以下の用途で使われる]",
        " 1. 3つ以上並んだ項目を分ける：",
        " \tI like apples, bananas[* , and] oranges. （2つのときは`and`でつなぐのみでよい）",
        " 2. 二つの独立節を等位接続詞（coordinating conjunctions）（and, but, for, nor, yet, or, so）でつなぐ",
        " \tI went out[* , but] he stayed home.",
        "\t3. 文章が導入部分を持つとき、それを区分けする",
        "\t\t副詞節（adverbial clause）：",
        "\t\t\tThough I had read the book, I did not remember the details.",
        "\t\t分詞構文（participle construction）：",
        "\t\t\tWalking down the street, he found a book store.",
        "\t\t前置詞句（prepositional phrase）が長いとき：",
        "\t\t\tAfter reaching the maximum speed, the train decreased its speed and went into a tunnel.",
        "\t4. 挿入句（parenthetic phrase）または同格の句（appositive phrase）",
        "\t\t名詞句（noun phrase）",
        "\t\t\tKeiko, his girlfriend, went to Paris.",
        "\t\t動名詞句（gerund phrase）",
        "\t\t\tMy favorite sport, walking around my house, costs little or no money.",
        "\t\t不定詞句（infinitive phrase）",
        "\t\t\tHis plan of the night, to have dinner with friends, never materialized.",
        "\t\t非制限的関係節（non-restrictive relative clause）",
        "\t\t\tMr. Suzuki, who used to be a company president, likes skiing.",
        " [** こんな時は付けない]",
        "　1. 複合述語（compound predicate）の間のコンマ",
        "　\t\tKenta will sing and play the piano.",
        "　\t特に長い動詞句でできているときは注意する",
        "　\t\tNG：I meant to buy tickets for Kenta's show, but ran out of time.",
        "　\t\t⇒ I meant to buy tickets for Kenta's show but ran out of time.",
        "",
        "\t2. (数式)全称記号の前：",
        "\t\t [$ F(x)^\\top (y-x)\\geq 0, \\forall y\\in S]ではなく、[$ F(x)^\\top (y-x)\\geq 0\\ \\ \\forall y\\in S]",
        "",
        "[*** 冠詞]",
        "　よく最適化分野では最適化問題をアルファベットで定義することがある。たとえば、",
        "\t\t(MPEC) [$ \\min f(x,y)\\ \\text{s.t.}\\ x\\in X,\\ y \\text{ solves } \\mathrm{VI}(F(x, . ), S). \\ (1) ]",
        "としたとき、これを参照するとき、the (MPEC) と書くこともあるが、Section や Theorem を参照するとき同様、冠詞は付けない流儀（固有名詞とみなす）が最近は主流になっているらしい。",
        "　　例文： [* MPEC (1)] contains an equilibrium problem in constraints.",
        " ただし、論文中のMPECではなく、一般名詞の略語としてのMPECを挿す場合は冠詞を付ける。",
        "  It is well-known that an MPEC is difficult to solve in general. ",
        ""
      ]
    },
    {
      "title": "選択疲れを緩和する方法",
      "created": 1629629958,
      "updated": 1629630975,
      "id": "61222dfd006de9001d9edf61",
      "lines": [
        "選択疲れを緩和する方法",
        "#well-being ",
        "",
        "[** 小さな選択はしないようにする]",
        "例えば毎日着るスーツをどれにしよう、など些細な選択はせずに済むように同じ規則でルーティン化できるように仕組みを立てておくとわざわざ選択しなくて済む。小さな選択が大きな選択のように感じてしまっているときは「この選択って自分の人生左右する？」と問いかけてみよう。",
        "",
        "[** 意思決定に優先順位をつける]",
        "意思決定に最もエネルギーを注げるのは朝。このときに全体的な把握能力や集中力を要する大きな意思決定を済ませるようにする。例えば、タスクのリストを作成することなどは朝にやっておくほうが効率よくできるだろう。この時に優先順位何なのかをはっきりしておけば、あとになってどれからやるべきだったかもやもやしなくてよくなる。",
        "",
        "[** 疲れているときに意思決定をしない]",
        "疲れているときは単純な作業しかできない、昼以降になると大体人間はシンプルな嗜好しかできなくなると思った方がいい。一日の時間がたつほどシンプルな意思決定で済むような軽いタスクになるようにする。先述の優先順位もそのように計画を立てるとよいだろう。",
        "",
        "[** 健康に気を配る]",
        "良い意思決定は良い健康状態と良い精神状態から生まれる。睡眠から散歩といった所まで、心身の健康を促進するような活動を優先的に行い、体を労わろう。そうすることで、ストレスフルな環境での意思決定になってしまうことを防ぐ助けになる。",
        ""
      ]
    },
    {
      "title": "大西さん最終発表メモ",
      "created": 1626943144,
      "updated": 1626944067,
      "id": "60f92ea50faed3001db73d20",
      "lines": [
        "大西さん最終発表メモ",
        "#スケジューリング",
        " 経験豊富なスタッフへの過負荷",
        " 数理計画を使わない，要望への対応が難しい",
        " ORを使うと，割り当て変更後のスタッフへの説明が大変⇒システムの更新に時間がかかる⇒めんどくさいが勝って本格的な導入をためらうことがほとんど...",
        " ほとんどのUCTTPでは，時間割作成と教室割り当てが別々で行われている．これを統括することは難しい？",
        "　",
        ""
      ]
    },
    {
      "title": "決定木",
      "created": 1626191881,
      "updated": 1626942732,
      "id": "60edb7f6e057f70022565215",
      "lines": [
        "決定木",
        "#機械学習 #Kaggle #MachineLearning",
        "(Kaggle のチュートリアルから)",
        "",
        ""
      ]
    },
    {
      "title": "論文紹介するときの注意点",
      "created": 1625723059,
      "updated": 1625825136,
      "id": "60e690afc7a1a7001e62a901",
      "lines": [
        "論文紹介するときの注意点",
        "#論文紹介 #ゼミ #研究室",
        "",
        "[** 論文紹介では紹介する定理を図で説明して，まず論文の全体像を聴衆にイメージさせてあげる必要がある．]",
        "　複雑な証明を必要とする場合，著者はあらかじめその補題や命題，定理などの前にどのような役割を果たすのか書かれている．",
        "　一方，メインとなる定理の証明まで読み進めなければ，その前までの補題などの主張が見えてこないこともしばしばある．",
        "　どちらの場合も，同じような一つの示したい理論的成果を目標にしているので，下のような関係図のようなものが描けるだろう",
        "[https://scrapbox.io/files/60e81f65e596fe001c4043b3.png]",
        "",
        ""
      ]
    },
    {
      "title": "リサーチの技法",
      "created": 1624878561,
      "updated": 1624878616,
      "id": "60d9adde4b0046001f618247",
      "lines": [
        "リサーチの技法",
        "#研究 #研究の指南 #研究の進め方",
        "[https://scrapbox.io/files/60d9ae155f32ac002226d869.png]",
        "",
        ""
      ]
    },
    {
      "title": "志望動機の書き方",
      "created": 1622447900,
      "updated": 1622469664,
      "id": "60b49715aac9de001c47a587",
      "lines": [
        "志望動機の書き方",
        "#就活 #キャリア",
        "いつも時間がかかりまくるので、テンプレートを考える。",
        "ひとまず以下の二点はマストであると考える。",
        "",
        "[*** 重要：人事および読み手の技術者は自分の何を知りたいのか、読み手の目線を忘れないこと！読みやすさ、論理の跳躍がないかを確かめること！]",
        "",
        "[** 1. 自分と志望先の共通点を見出す]",
        "　例えば、自分の研究分野が数理最適化であり、志望先の企業の研究テーマが最適化技術の開発だとすれば、まずそこに共通点があることを述べる。",
        "",
        "[** 2. 共通点を踏まえて、どんな点で新たな価値を創造してくれるかを明らかにする]",
        " 会社はビジネス的価値を見出せる人材を探しているため、共通点においてどんな相乗効果を生み出してくれるか積極的にアピールすることが大切である。受け身のインタビュー、自分語りでは相手は興味を持たない。常に相手の求めているものは何かを意識した資料作り、および面接での回答をすること。",
        "",
        "自分の性格に関する記述もできそうであれば、それも含めて以下のように構成するとよい",
        "[** A. 自分の性格と職種との相性]",
        "　実際のエピソードも踏まえて自分が（仕事に似た）タスクに対してどんな取り組み方をしてきたのかを記述すると相手側からすれば、入社後の自分のイメージが湧きやすい。また、その取り組み方を通して自分はこんな性格だということも併せて書くとより分かりやすい。",
        "　さらに自由な記述が認められているものであれば、短所に関しても少し触れておく。自分から進んで書いていいものではないと思うが、短所を含めた考察は自分をどれだけ達観できているかを評価するうえで重要なポイントだと考える。",
        "",
        "[*** ひな形？]",
        "1. 共通点を見出す",
        "　私が貴社の〇〇開発を志望する理由は、貴所は〇〇技術に関して盛んな研究開発をされていることから、自身の研究テーマである数理最適化と共通点を感じたためです。",
        "　〇〇技術は数理最適化の理論やアルゴリズムが根底にあり、そこの開発に携わりたいと思っています。",
        "",
        "2. 貴社がどんな点で私を採ると嬉しいのか",
        "　私は最適化の研究を通して近年の機械学習に関するアルゴリズムや理論に関して深い知識を養ってきました。",
        "　また、自身の研究では数理モデリング手法を提案していることから、世の中のまだ求解アプローチが提案されていないような社会の諸問題に対して、計算機で解を求めるための手法を修士、博士と通して考えてきました。この技術は貴所が研究開発を行っている分野において必要とされるモデリング能力を十分有していることから、入社後も積極的に貢献できると考えています。",
        "　また、アルゴリズム実装能力に関しても、そのモデリングされた問題を解くためのプログラムを数多く作成してきた経験があります。例えば、再モデル化した問題がまだ世の中で普及されていない非線形半正定値計画問題だったときは、自分で内点法をPythonで実装できる力を有しています。",
        "　さらに、フリーランスの仕事では大規模な大学時間割編成という、複雑な制約条件が絡んでいる組み合わせ最適化問題に対してモデル化、およびアニーリング法をベースとした時間割を自動で作成するスケジューラの開発を行った経験があります。",
        "　こうした業務経験は貴社でも強く生きてくると考えています。",
        "",
        "",
        "[*** 補足：インターンシップの場合]",
        "インターンシップの場合は採用面接とは異なるため、着眼点を変える必要がある。",
        "[** 体験型の場合：インターンシップを通して自分が経験したいことを書く]",
        "　大手はこっちが多いかもしれない。逆にベンチャーとか中小だと、やることが特化されているため、やりたいことはあなたで自身で決めて進めなさい、ガイドは基本的にしないよ、という一社員として働かせた時のパフォーマンスを測るような企業もある。",
        "　基本的にインターンシップは企業に興味を持つための機会として与えられていると考えるため、自分中心の動機を書けばいいと思う。",
        "　先述した「共通点」からマッチングする確率を上げることが重要なので、具体的に技術的共通点を見出せるように書くことを心がける。",
        "[** 実践型の場合：期間中で体験・習得したいこと＋貢献できそうなところ（少しばかり）]",
        "体験型で述べたことを少し絞って、どんな点でそのインターンプログラムで貢献できそうなのかを書くとよい。レベルの高い企業ほどパフォーマンスを見られている",
        "　年功序列関係なく、成果主義の気鋭の社員がそろった会社は基本的に1日目から能力を「見極められている」と見た方がいい。つまりインターンの結果が採用に直結しているパターンである。",
        ""
      ]
    },
    {
      "title": "自分の生き方に関して",
      "created": 1622461194,
      "updated": 1622462213,
      "id": "60b4cb07e7f7cd001e680a70",
      "lines": [
        "自分の生き方に関して",
        "#人生",
        "",
        "[*** 自分の性格に関して]",
        "[** マルチタスクができない]",
        "　これまでに複数のことを同じ期間にこなさなければならない時、まずもってうまくいっていないような気がする。",
        "　会社員の経験では複数のタスクをこなすことが難しいことを肌で感じた。",
        "",
        "[** 非定型的な作業が苦手]",
        "　いわゆる答えのある問題に対しては積極的に何時までも考えていられるが、答えのない質問に対しては漠然としすぎて何を問われているのか、この質問は何を求められているのかを理解することが人一倍苦手である。",
        "",
        "[** 妥協を人一倍許さない⇒エネルギー配分が極端]",
        "　一点目と同じことかもしれない。",
        "　特に芸術的なセンスに依る作業に対しては人一倍のめりこむところがあるようで、昔からアイデアを練るのに時間がかかり、さらにその計画性がないことから、居残りをすることがしばしばあった。その性格はどうやら今でも研究や仕事などで如実に表れているようである。",
        "",
        "[*** 生きづらさを少しでも軽減させるためには？]",
        "[** 真に打ち込めるものに好きなだけ費やせることにコミットしたほうがいい]",
        "　今更マルチタスクを器用にこなせるようになろうと奮闘するよりも、真に打ち込めるものに好きなだけ費やせることにコミットしたほうがいい、と考える。おそらく、マルチタスクを「究める」こともできなくはないが、それが同時に自分の満足のいくものは作れないことを示唆する。どうしても人より苦手なタスクが来てしまうと、良いものにしなくてはとずいぶん時間をかけてしまう。それを諦めたらきっと粗末なものしかできないのではないか？",
        "　実際、タスク処理を優先して作成したエントリーシートなども読み返してみたら、不明瞭な文章が散見され、すべて変えないといけないような粗悪な文章しか書けなかった。",
        ""
      ]
    },
    {
      "title": "研究内容に関して(1000～2000字版)",
      "created": 1620836490,
      "updated": 1622186012,
      "id": "609c007c410eac001cb4b60a",
      "lines": [
        "研究内容に関して(1000～2000字版)",
        "#就活 #インターン #キャリア #研究",
        "",
        "",
        "[** 日本語版]",
        "研究テーマ：『分布不確実性の下での新しい確率的均衡モデルの提案と求解アルゴリズムの開発』",
        "　私の専攻分野である数理最適化についてまず説明する。数理最適化は数式で与えられた制約条件の下で評価関数を最小（最大）化するような解を求めることをいう。数理最適化は近年社会に馴染みつつある機械学習やデータサイエンスにおいても基礎的な役割をしており、年々注目を集めている分野である。",
        "　特に私の研究対象は均衡問題と呼ばれる数理最適化を含むようなより広いクラスの問題の研究を行っている。均衡問題は交通工学や経済学をはじめ、単一の最適化問題としてモデル化できないような問題で利用されている意思決定のための数理モデルであり、実社会の諸現象や課題を解析するうえで強力なツールである。特に確率的均衡問題（SEP: Stochastic Equilibrium Problem）は将来確定する不確実性パラメータ（確率変数）を含む均衡問題であり、ここ20年で活発に研究されている。",
        "　これまでのSEPに関する研究はモデルに現れる確率変数の分布が正確に分かっていることを前提としている。そのため、Monte-Carlo法などを利用することで期待値の計算などを近似的に行える。しかし、実社会で現れる不確実性は必ずしも分布を特定できないことがしばしばある。",
        "　仮に観測データを用いて特定の分布を仮定し、既存のSEPの手法を適用すると、たとえ微小なずれであっても頑健性を考慮できていない。そのため、平均や最頻値といったある種のデータの中心から離れた実現値を当てはめた場合、大幅に均衡条件の式を違反し、結果的にシステムに壊滅的な被害をもたらしかねない（リスク理論では『黒い白鳥』と呼ばれる現象）。",
        "　そこで私は分布の不確実性を考慮したうえで頑健な均衡解を求めるための期待残差最小化モデル（ERM）を提案した。",
        "",
        "",
        "[** 英語版]",
        "研究テーマ：『Studies on Stochastic Equilibrium Problems under Distributional Uncertainty』",
        ""
      ]
    },
    {
      "title": "転移学習",
      "created": 1622085323,
      "updated": 1622085955,
      "id": "60af0ec7e83d2c001c403187",
      "lines": [
        "転移学習",
        "#機械学習",
        "",
        "[** ある領域の学習済みモデルを類似した別の領域に適用させることで効率的に学習させる方法]",
        "　あるタスクで高い精度を残した学習モデルの結果を別のタスクに転移させることで学習効率を上げる方法．転移学習を利用すれば一般に少ないデータで学習できる．",
        ""
      ]
    },
    {
      "title": "自分の天職を見つけるヒント",
      "created": 1621918402,
      "updated": 1621924498,
      "id": "60ac82b976902800238194fc",
      "lines": [
        "自分の天職を見つけるヒント",
        "#キャリア #仕事",
        "",
        "[https://www.youtube.com/watch?v=Q3Umpw_Z54A&t=650s]",
        "",
        "[** できること(can)，したいこと(want)，求められていること(need)の共通部分を探せ]",
        "　仕事を続けていくためには自分のしたいことだけではなく，実際に世の中に求められていることも視野に入れながら，自分の持ち得るものも把握して選ぶ必要がある．何も技術のない所から生業にするのは無理があるため，現実的に今の自分を分析する必要がある．",
        "",
        ""
      ]
    },
    {
      "title": "Resume (English) for Job Hunting",
      "created": 1620837414,
      "updated": 1620839126,
      "id": "609c042302c1a8001da7a7cb",
      "lines": [
        "Resume (English) for Job Hunting",
        "#就活",
        "",
        "[**  Self-introduction]",
        "=== About My Research and Background ===",
        "I am a Ph.D. student at the Graduate School of Informatics, Kyoto University. My major is applied mathematics, and my research is mathematical optimization. Especially I study stochastic equilibrium problems (technically known as stochastic variational inequality and complementarity problems) which have many applications in the real world such as noncooperative game theory and traffic engineering.",
        "My main research activity is to do mathematics but I have work experience in programming. For example, I worked for Mitsubishi Electric Corporation for two years as an embedded software engineer before entering Kyoto University.",
        "In addition, I currently work as a freelance to develop software mainly using Python. In recent works, I have experienced implementing an image segmentation system.",
        "",
        "[** Work Experience]",
        "[* SUSLAB]",
        "I develop new technologies for Society 5.0 which is the 5th science and technology basic plan proposed by the Japanese government. I have engaged in the development of image processing or generating 3D models using new machine learning technologies. Now, I develop new software for scheduling by using mathematical optimization.",
        "[* Mitsubishi Electric Corp.]",
        "I worked as an embedded software engineer especially in AUTOSAR, which is a software platform for vehicles, at Automotive Electronics Development Center in Himeji and have experienced how to learn new skills beyond my academic background which is mathematical optimization. Besides, through the work of AUTOSAR development, I learned: 1. debugging the large-scale programs, 2. not relying on intuition but logical thinking to work accurately.",
        "",
        "[** Academic Experience]",
        "[* Master's degree]",
        "The link is my first article submitted in an international journal. The study is a joint work with Prof. Masao Fukushima (Professor Emeritus of Kyoto University).",
        "[* Bachelor's degree]",
        "I learned control theory and basic mathematics for optimization in freshman and sophomore, after assigned to Prof. Masao Fukushima's laboratory, I studied mathematical optimization theory, and I proposed a new algorithm for solving an equilibrium problem, called multi-leader--follower games which is an extension of Stackelberg game and was not easy to solve so far.",
        ""
      ]
    },
    {
      "title": "志望理由の共通となる文案",
      "created": 1620836542,
      "updated": 1620837090,
      "id": "609c00b483e4d7001c6a1dbb",
      "lines": [
        "志望理由の共通となる文案",
        "#就活 #キャリア #自己分析",
        "",
        "[** スキルアピール（自分はこんな能力を持っているから貴社で活躍できる）]",
        "　研究生活で他人より磨かれた自己管理能力と遂行能力",
        "ドクターの研究はほとんど一人で研究テーマを探すところからすべて一人で行う．基本的に指導教員のアドバイスを仰ぐときは成果が出たときであり，決まった報告習慣もないのではじめはかなり計画通りにいかなかったり，そもそも計画が破綻していることに実行してから気づいたりして中々研究が進まなかった．しかし，そんな中毎日目標をもって日々の当たらに習得することに喜びを感じながらここまでやってこれたのだと思う．こうした精神的な修行を伴うものは修士まででは得られないだろうと考える．",
        "",
        "[** 退職D進の訳（なぜ会社を辞めて進学をしたのか？何故アカデミックにそのまま進まず民間企業に戻るのか）]",
        "　数理的な理論を利用して世の中を最適化する研究者になるため",
        "",
        "",
        "[** 職場・人について（自分が重要視したい点＝人間関係こそ仕事を進める原動力．そばに刺激を受けられる人がいるかどうかが自己の成長に大きくかかっている）]",
        "",
        ""
      ]
    },
    {
      "title": "深夜にひらめくアイデアについて思うこと",
      "created": 1620769245,
      "updated": 1620769710,
      "id": "609af9cfe8aa48001c02a864",
      "lines": [
        "深夜にひらめくアイデアについて思うこと",
        "#研究 #発想力 #生活習慣 #健康",
        "",
        "[** 深夜のひらめきは充てにならない事が多い]",
        "夜になるとまるで覚醒したかのように作業が進むことを良く経験する．しかし，これらで生み出されたアイデアというのはどこか脳の疲労感からか根幹的な前提条件が崩壊しているような，破綻したアイデアであることが多い．",
        "たとえば，研究で新しい研究テーマを探すとき（今もその最中であるが），思いつかない思いつかないといっていて夜にひらめきを感じることがあり，そのまま手を動かしてみる．これでいいじゃないか？と期待を胸にしまったまま朝に眠る．しかし，起きてまた考え直したとき，根本的に前提が崩れていて全く使い物にならないという場合の方が多い．むしろ，作業のような脳への負荷が低いものを夜にやると集中して進められるし，ミスったとしても気付きやすいので何とか修正は利く．ところが発想力を使う場合それは通用しないことが経験上多い気がする．",
        "要するにアイデアは朝の方が「正しい」探索が可能であるといえる．ここで，「正しい」探索とは前提条件を見落とさないような適切な想像（知識のすり合わせ）のことをいう．",
        ""
      ]
    },
    {
      "title": "研究の進め方",
      "created": 1620479844,
      "updated": 1620479880,
      "id": "60968f59705bbd0022f303b4",
      "lines": [
        "研究の進め方",
        "#メモ #研究\t#研究の指南",
        "",
        "https://takahashihiroshi.github.io/contents/for_ml_beginners.html",
        ""
      ]
    },
    {
      "title": "大西さん中間発表",
      "created": 1620290951,
      "updated": 1620294539,
      "id": "6093ad84686d9d0022257a2e",
      "lines": [
        "大西さん中間発表",
        "#スケジューリング #オペレーションズ・リサーチ",
        "　手作業",
        "パズルを解くように作成している（経験と勘によるものが大きい）ため、担当者退職後の負担が大きい",
        "　商用の時間割割り当てソフト",
        "費用対効果",
        "割り当て後の効率性",
        "ORを使ってないから、学生、教職員の細かい要望を満たしにくい",
        "時間割編成に関して、独自運営ルールがあるため一般的な定式化が難しい",
        "　教室割り当て問題",
        "連続クラスは同一教室か近い教室に割り当てる",
        "最小費用流問題（LP）に帰着させることで高速化（コストが整数ならば、整数解になる保証がされている）",
        "　質問",
        "1. VBA(Excel) とPython の使い分けに関して具体的に知りたい（最適化計算はpythonコード？）",
        "2. 分割した問題は独立している？7つに分割した問題がよくわからない。",
        "UCTTP共通の制約：",
        "[https://scrapbox.io/files/6093ad91698dca001c789ede.png]",
        "南山独自の制約：",
        "[https://scrapbox.io/files/6093adc47ab203001ca53487.png]",
        "教室割り当て問題を7つの部分問題に分割：",
        "[https://scrapbox.io/files/6093aebbab69b40023e089f7.png]",
        "",
        "[** 感想：]",
        "　実社会ではORを導入する以前にまず情報化されていないものを見えるかするだけでかなり価値があると評価されている印象。実際、発表にあった図書館の書籍の移動に関しても一橋大学ではORを用いずに図書移動の効率化アプリをリリースしている。",
        "　結果論ではあるが、ORをホントの意味で活発に社会に用いられるためにはずいぶん時間がかかってしまう。",
        ""
      ]
    },
    {
      "title": "論文の読み方",
      "created": 1619775306,
      "updated": 1619777523,
      "id": "608bcf42e10935001f4a6ef7",
      "lines": [
        "論文の読み方",
        "#研究の指南 #研究 #論文の読み方",
        "",
        "参考：http://www.lenmholmes.org.uk/students/how2read/how2read_a.htm",
        "[** 論文は小説のように通読しない]",
        "精読するとなれば一文一文を具に噛み砕く必要があるが、大抵は論文の中でも興味のあるところをピックアップして読むのが通常。",
        "",
        "[** 適切な方法で読めば、効果的かつ効率的に著者の主張を汲み取ることが可能]",
        "すべての主張、議論には特定の構造をもっているため、読者はその構造を読み取ることが大切",
        "",
        "[** 論文を読むスキルは練習で身に付けられる ー 効果的に練習した場合]",
        "大切なのは必要に迫られてただひたすら論文を読み続けるのではなく、「悪い癖」がつかないように意識して読むことである。これは野球選手がフォームが崩れないように常日頃コーチなどに指導してもらいながら基礎練習を積み重ねることと似ている。",
        ""
      ]
    },
    {
      "title": "Python/Pandas メモ",
      "created": 1619616937,
      "updated": 1619676448,
      "id": "608964a78ca6d40023163999",
      "lines": [
        "Python/Pandas メモ",
        "#Python #プログラミング",
        "",
        "[** Q1: 読み込んだPandas のデータフレームに対して列スライシングを行い、複数の連続する列を抽出する]",
        "A: `df.loc`を用いる",
        "以下のようなデータフレーム`df`があったとする（以下でもこれを利用することがある）。",
        "-\ta\tb\tc\td",
        "0\t123\t345\t456\t678",
        "1\t213\t513\t932\t329",
        "2\t481\t931\t324\t801",
        "`df.loc[:, \"a\":\"c\"]`とすると、a列からc列までを抽出してくれる",
        "",
        "[** Q2: データフレームを for 文で用いるとき]",
        "A: `df.itertuples()`を用いる",
        "例えば、`for i in df.itertuples():`とした場合、`i`には各行のデータがオブジェとして格納されている。最初の行なら",
        "`Pandas(Index=0, a=123, b=345, c=456, d=678)`",
        "となる。注意点としては列名が日本語の場合、つまり全角の場合も文字列リテラルとして`\"`で囲われないため、例えば、dfのb列の名前が「数値」という名前だった場合、参照するときは`i.数値`という形になる。",
        "他にも for 文で似たような形でデータフレームの各行を参照できるメソッドはあるが、`itertuples()`が高速だという。しかし、速いとは言ってもそもそもデータフレーム型の変数を for ループで使う事自体かなり処理が遅い問題があるため、できるだけ避けたいところ。",
        "",
        "[** Q2': どうしても for ループを使うとき]",
        "[*** A: ]アトリビュート`to_dict()`を用いていったん辞書型に直す。",
        "`df.to_dict(orient=\"records\")`とすれば、`df`は辞書型に変換することが可能。",
        "code:python",
        " df_dict = df.to_dict(orient=\"records\")",
        " for i, elem in enumerate(df_dict):",
        " \t# loop",
        " \t# 必要あれば二重ループ",
        " \tfor j in elem.values():",
        " \t\t# 2nd loop",
        "としておけばよい（`orient~`を付けないとうまくいかない）。",
        "",
        "",
        "[** Q3: 複数の条件を満たす行のみを抽出したいとき]",
        "[*** A: ]添え字の`[``]`にそのまま条件式を書き込む",
        "たとえば、`df`の`b`列の値が500以上の列のみを抽出したいときは",
        "`df[df[\"b\"] >= 500]`",
        "と書くことで0行目を取り除いた2つの行データフレームが返される。",
        "次に、`df`の`b`列の値が500以上かつ`d`列の値が600以上のものを抽出したいとすると",
        "`df[(df[\"b\"] >= 500) & (df[\"d\"] >= 600)]`",
        "と書けば、2行目のみが抽出される。",
        "論理記号は通常のPythonと同様の仕様となっているが、否定だけは`not`ではなく`~`を使う点に注意する。",
        "",
        "[** Q4: 条件に一致する行番号を抽出するには]",
        "[*** A: ]`.index`を使う",
        "Q3のように条件を指定した場合、一致する行のすべての列データが出力されるが、行番号のみ保存しておきたいときは後ろに`index`をつければよい。",
        "",
        "[** 辞書型はデフォルトでキーを返す]",
        "for ループで`tst = {\"apple\": 100, \"banana\":50, \"orange\":86}`という辞書を利用するとしよう。このとき、`for j in tst:`とかくと、`j`にはキーが格納されるようになっている。つまり、`j=\"apple\", \"banana\", \"orange\"`となる。値を利用したいときは`for j in tst.values():`とする。",
        "そうはいえども、普通は`for j in tst:`としても、`tst[j]`で値は[$ O(1)]で参照できるので問題ない（ハッシュテーブルを用いているため。実はリストの参照は線形探索なのでとても遅い、可能なら辞書型もしくは集合型を利用すると良い）。",
        "",
        "[** Q5: 一部の列で条件を満たすものを抽出]",
        "参考：https://qiita.com/kouki_tsuji/items/e53973715c4c5874e151",
        "",
        ""
      ]
    },
    {
      "title": "小器用と不器用、読書について",
      "created": 1619490071,
      "updated": 1619490988,
      "id": "6087750ff6e103002348f628",
      "lines": [
        "小器用と不器用、読書について",
        "#人生",
        "",
        "[** 小器用は一番伸びない。なら不器用であった方がいい]",
        "",
        "[** 友達いなくて本を読むのではなく、本を読むから友達がいらない]",
        "友達いなくて寂しいと感じる人はむしろ本を読まない",
        ""
      ]
    },
    {
      "title": "日本語の作文技術",
      "created": 1619234993,
      "updated": 1619235892,
      "id": "608390a7794196001c2e451a",
      "lines": [
        "日本語の作文技術",
        "#日本語の作文技術",
        "",
        "[** 長い修飾語は前に、短い修飾語は後に]",
        "主述関係は日本語の作文を考えるとき、百害あって一利なし",
        "",
        "[** 大状況から小状況へ、重大なものから重大でないものへ]",
        "英語とは違って文脈の齟齬が起きないためには全体像から描写するのが良い",
        ""
      ]
    },
    {
      "title": "数式の表記",
      "created": 1619026202,
      "updated": 1619026310,
      "id": "608061146c8a60001d9d117e",
      "lines": [
        "数式の表記",
        "#論文作成 #論文作成の技術 #研究の指南",
        "",
        "[** 部分集合の記号は基本的に\\subset]",
        "山川先生のコメントを引用する",
        ">部分集合に関する記号のコメントですが、現在の数学記号の習慣として、¥subsetを使うのが主流です。¥subseteqは基本的にあまり使われません。どうしても真部分集合を主張したい場合などは¥subsetneqを使います。",
        "> 工学ではまた話が違うのかも知れませんが、少なくとも数学の方面ではそのような習慣があるので修正しました。",
        "",
        ""
      ]
    },
    {
      "title": "英文法（メモ）",
      "created": 1617942455,
      "updated": 1618679900,
      "id": "606fd7ab5055b4001c84e76d",
      "lines": [
        "英文法（メモ）",
        "#英語 #EnglishWriting #論文作成",
        "",
        " per のあとは冠詞を付けない（NG: per an instance -> OK: per instance）",
        "　固有名詞として利用するときは普通 'the' をつけない（the DRO (1) -> DRO (1)）",
        "　The problem (1) -> Problem (1) とする",
        " 数詞は時に形容詞的扱いとなり、直前に修飾する単語の品詞は副詞になる",
        " 　例：The demand for electric automobiles has increased by 50 percent => by nealy(adv.) 50 percent",
        ""
      ]
    },
    {
      "title": "実践・日本語の作文技術",
      "created": 1618667805,
      "updated": 1618669623,
      "id": "607ae911b0ac5100226b4bbf",
      "lines": [
        "実践・日本語の作文技術",
        "#読書メモ #文章技術 ",
        "[https://scrapbox.io/files/607af032f095310022c26a23.png]",
        "",
        "[** 読点の議論]",
        "日本語は英語と比較して読点に関する決まりが統一されていない。特に文学作品では、読点の打ち方は感性による側面が大きい。例えば、以下のように読点は時によって事態の深刻さを表す。",
        "『母は去った』vs 『母は、去った』",
        "",
        "[** 想像力・独創力を必要とする作文技術は軽視されてきた]",
        "筆者は54頁にて痛烈な批判をしている。",
        "『（中略）日本の日本語教育の根幹を流れる方針は、理解力や記憶力ばかり重視し、独創性・創造力・想像力を最も必要とする作文を軽視または無視するというやり方です。これは政府・権力の命ずることをひたすら「理解」し、要領よく「まとめる」人間、つまり管理される人間と、それを管理する無能な役員を育てるのには適していますが、みずからの頭でものを考え、独創的な仕事をする人間を育てるのには適していません。文部省もよく考えているのには本当に感心します。だから今の小学校では「綴り方」の時間さえもあまりなくて、そのかわり「読書感想文」などというものがあるんですね。あれは作文というよりも理解力テストみたいなもので、あれで作文をやったつもりでいたら噴飯ものというべきでしょう。おかげで読書も嫌いになる。』",
        "",
        "[** 人は読書によって知識が豊富になり、会話を交わすことによって能弁になり、書くことによって正確になる]",
        "哲学者・フランシス＝ベーコンの言葉（塚本憲・訳）",
        "フランシス＝ベーコンは忘恩の徒といわれ、生前は汚職賄賂等で起訴されていたりと問題を起こしていたらしいが、上の言葉にはわれわれ人間にとって普遍性を感じるものだ。",
        "自分自身が納得できない問題があれば書き下してみると良い",
        ""
      ]
    },
    {
      "title": "文章読本",
      "created": 1618127763,
      "updated": 1618127820,
      "id": "6072ab8ecf789e001f3af644",
      "lines": [
        "文章読本",
        "#三島由紀夫 #読書メモ",
        "",
        ""
      ]
    },
    {
      "title": "Wanna-beからの脱却",
      "created": 1618031422,
      "updated": 1618031422,
      "id": "6071333b3f06cf001c405c7a",
      "lines": [
        "Wanna-beからの脱却",
        "#Thought",
        "",
        "[** Wanna-be, wanna-do では結局何もせず時間を無駄にする]",
        "　ウェブは知りたい情報が簡単に手に入るため、軽い気持ちではじめられる物事が増えた。このこと自体の恩恵は計り知れないのは言うまでもないが、一方でちょっと手を付けてはやめるということを繰り返して一向に自分の掘り下げる道が見つからないまま時間を無駄にしていることもしばしばあるのだろう。",
        "　たとえば、「最近はプログラミングが人気なのではじめよっかな～」という風に軽い気持ちではじめてみたものの明確な目標がないから結局続かず、またどこかでやればいいかと諦める。高橋直大さんによれば、プログラミングをやろうかなと言ってるうちは一生やらないと言っているようなものらしい。",
        "　確かにそうだ、これまで「やろうかな」で踏み出せたことは一度もない。人が何か物事を始めるきっかけは、1. 必要に迫られているからやる、2. 強制的にやらされる、3. それをすること自体が[* 大]好き、という3つくらいしかない。( https://twitter.com/i/broadcasts/1ynJOBYrBDAGR 50:00) ⇒ [* 目的が何なのか、どうなりたいかがはっきりしていないと本気で極められない]。そして、この目的が明確なほど成し遂げられる可能性は高まる。",
        "　そのため、なんとなく「やろうかな」精神で漂着を繰り返していると時間だけが経って行き、結局自分は本当は何をしたいのだろう...と目的を失った空虚感に打ちひしがれるのである。",
        "",
        "[** 目的化するためには今の自分を知り、何故その目的を持つのか明確にする]",
        "　Wanna-ber や wanna-doer でとどまらないためにも、明確に目的を持って何事にも取り組まなければならないことは述べた。そうはいっても、極論を言ってしまえば日本に住んでいる限り、人生というのはそんなに頑張らなくても正直死にはしないほど楽に暮らしていける。そんな中でも自分は何故それを頑張りたいのか、という根底から自分を見つめないと変われないのではないかと最近感じている。",
        "　何かを頑張る理由というのは究極的には「（極めた先の）[* 新しい世界を見てみたい]から」ということに集約されると思う。人は変化を好み、パターン化されたものには飽きる性質があるし、決して義務感ですべてをこなしてきているわけではないと思う。大学に進学するために受験勉強を頑張るのも、新しい世界を見てみたいからだし、就職活動を頑張るのも自分の可能性を拓いて新しい世界を見てみたいからなのである。こうした話は進路だけじゃなくて、ゲームや趣味を極めるのも同じことがいえる。",
        "　新しい世界を見るためには自分が今どこに立っていてどの方向に進みたいのかを明確にしなければならない。方向を決めるためには「何故その方向に進むのか」という理由がなければ、いずれ迷子になるからだ。",
        "　たとえば、「英語を上達する」というのは漠然としておりこれでは一歩目が進めないし、進んだところですぐに迷子になるのは明らかである。重要なのはなぜ英語がうまくなりたいのか、そしてその英語が上達した先に何があるのか、ではそのためにはまず自分には何が足りていないのか、そしてその不足を補うために何をまずすればよいのか（直近の目標）、といった風に順番に逆向きで落とし込んでいく。",
        "　さらにこれは一度進めばその方向にまっすぐ進めばいいわけではない、途中で分かれ道が何本もあったり、行き止まりがあったりするため、直近の目標が終わったら、目標をアップデートしないといけない。そして、さらにこの時に目的を見失っていないのかしつこく確認する。今来た道は本当に当初抱いていた目的にたどり着けるのか、という風に。",
        "　もちろん、目的は近くなるほど道が険しくなったり、行き止まりが多くなったりして何度も行き返さなければならなくなる。これに関してはより厳しい目的把握能力と自己分析力がないと目的にたどり着く道を見つけられないだろう。ここに関してはもっと自分が極められたら新たな哲学が生まれると期待する。今はまだその境地にさえ立てていないことを実感している。",
        ""
      ]
    },
    {
      "title": "独創はひらめかない",
      "created": 1617539642,
      "updated": 1617942387,
      "id": "6069b20f6b2043002232f74b",
      "lines": [
        "独創はひらめかない",
        "#読書メモ #研究 #学振",
        "[https://scrapbox.io/files/606fd770f2f2ae001eabf5d9.png]",
        "",
        "",
        "[** TL;DR]",
        "",
        "[** みんな「これでいいのか？」と不安になっている]",
        "",
        ""
      ]
    },
    {
      "title": "ネットで数学的事柄を調べるときに役立つサイト",
      "created": 1617712377,
      "updated": 1617712462,
      "id": "606c54f53704f40022c28b3a",
      "lines": [
        "ネットで数学的事柄を調べるときに役立つサイト",
        "#数学 #お役立ち",
        "[** Convex Analysis]",
        "https://maunamn.wordpress.com/",
        "",
        "[** 確率論]",
        "https://stats.libretexts.org/",
        ""
      ]
    },
    {
      "title": "自己分析カード",
      "created": 1617345840,
      "updated": 1617674798,
      "id": "6066bd2ab3f86c0022769d31",
      "lines": [
        "自己分析カード",
        "#自己分析 #就活 #キャリア #学振",
        "",
        "[** 自身の強みは何ですか？]",
        "",
        "",
        "[** 今後研究者としてさらなる発展のために必要と考えている要素]",
        "1. ",
        ""
      ]
    },
    {
      "title": "研究テーマの選び方",
      "created": 1617342017,
      "updated": 1617342257,
      "id": "6066ae2d099bf80021e00f63",
      "lines": [
        "研究テーマの選び方",
        "#研究の指南 #研究",
        "",
        "[** どんな問題にフォーカスするのか]",
        "[_ テーマ選びのポイント（興味が持たれやすい順）]： ",
        "　1. 現実の問題を例にして課題があることを明示し、それに共通する問題構造を定式化して研究。（例：AとBという手法では問題aとbに対してうまく働くが、aにもbにも属さないようなcという問題に対しては圧倒的に劣る。そこでCという手法を提案する。）",
        " 1. [* 応用として十分考えられるが、基礎研究されていないようなモデル]を考えた方がよほど価値が高い。",
        " 2. 他の問題でうまく解けている手法を輸入できないか検討する。\t",
        "\t3. モデル自体は考えられているが、研究がまだ少ない場合。改善の余地が[* 十分にあれば]、価値のあるものとなる。",
        "→ いずれにせよ、ある程度の研究者が興味をもっているテーマかどうかが見極めることが重要",
        "→ 究極的にはホットなところに足を突っ込むことだが、多くの優秀な研究者が競っている中で勝たなければならない点はかなりしんどい。",
        ""
      ]
    },
    {
      "title": "Distributionally Robust Neural Networks",
      "created": 1617334045,
      "updated": 1617335309,
      "id": "60668f10b2edd3001c57635f",
      "lines": [
        "Distributionally Robust Neural Networks",
        "#機械学習 #数理最適化 #ニューラルネットワーク #ロバスト最適化",
        "",
        "[* 参考記事]　https://www.acceluniverse.com/blog/developers/2020/01/distributionally-robust-neural-networks.html",
        "[* 原著]　https://openreview.net/attachment?id=ryxGuJrFvS&name=original_pdf",
        "",
        "　DROの考え方を機械学習に応用した非常に面白いモデル。",
        "",
        "[** 動機]",
        "　平均的な汎化誤差の最小化は正則化項を加える手法が一般的だが、時に極端なインプットに対して誤認する可能性が高まる場合がある。",
        "　例えば画像認識の問題で『水辺の鳥(waterbird)が写っている写真（背景：水辺vs野原=9:1）』と『野原の鳥(landbird)が写っている写真（背景：水辺vs野原=1:9）』を訓練データとして、テストデータで『野原の背景に水辺の鳥が写っている写真』や『水辺の背景に野原の鳥が写っている写真』に対する認識精度が上がらないという問題が起こる。",
        "[https://scrapbox.io/files/606691ef11c3c40022ad6c0d.png]",
        "　このような事例は特徴ベクトルの次元がサンプルよりも多いときに過適合として起こる。",
        "",
        "[** 手法]",
        "",
        "",
        "[** 気になる点]",
        "　DROに定式化し、ambiguity set を線形結合と仮定したため下記のようなmin-max問題：",
        "[https://scrapbox.io/files/606693a0521a660022bf8ef1.png]",
        "として帰着できたが、残差関数は[$ g]に関してどんな数学的性質を持っているのだろうか...",
        " もし、nonconcaveだとかであれば、これに対する変分不等式の手法を考えるのもありかもしれない。",
        " ambiguity set が「考えうる分布の線形結合」というのがどれほど一般的なのかがわからない。",
        ""
      ]
    },
    {
      "title": "数理最適化分野の研究指南（効率よく研究を進めるために）",
      "created": 1616994319,
      "updated": 1616997635,
      "id": "606160088c63e5001c5dba38",
      "lines": [
        "数理最適化分野の研究指南（効率よく研究を進めるために）",
        "#研究 #数理最適化 #研究の指南",
        "",
        "[*** 1. モデルの設定は慎重に]",
        "アルゴリズム研究よりモデルに重きを置いた研究の場合、仮定したモデルの設定が本当に現実の問題で考えうるものなのかどうかをはじめに考えなければならない。以下のような情報をもとに検討するのが良い。",
        " 1. 先行文献で既に取り扱っている（⇒それに対する優れた解法の構築）",
        "　\t注意：先行研究が少なかったり、応用が弱いものだとしたら考え直す必要がある。今回の研究はまだかなり強い仮定を置いており、自身も研究テーマの選別をもう少し慎重にする必要があったと反省。具体的に述べると、[$ F]が[$ \\xi]に関して線形という仮定が応用を極端に減らしているため、なかなか実用性は弱いと予感。",
        "　2. 応用例を考えてみたとき、乏しければ要再検討",
        "例えば変分不等式問題の中でも線形なものを取り扱おうとしたとき、その線形のモデルが実社会であまり見られないとき、当然応用もされないので研究する価値がない。",
        "",
        "[*** 2. 先行研究のPro/Con、および本研究の開拓する部分を明確にする]",
        "自分の行う研究と先行研究との[* ギャップ]は研究論文を作成するうえで必ず明記しなければいけないことである。ここのリサーチをおろそかにしていると、後々進めた研究結果が実は別の先行文献で提案されていました、なんてことが起こりうる。",
        ""
      ]
    },
    {
      "title": "関係節（relative clauses）",
      "created": 1616564648,
      "updated": 1616680639,
      "id": "605ad1a36b21fe002377a76c",
      "lines": [
        "関係節（relative clauses）",
        "#英文法 #論文作成 #EnglishWriting",
        "",
        "[*** 関係節とは]",
        "　ヒトやモノを特定したり、さらに情報を追加するときに使うもの。関係代名詞（relative pronouns）を主に扱う。",
        "",
        "[*** 前置詞＋関係代名詞って何？]",
        "　よく [/ in which] だの [/ of which] だの読むときは問題ないものの、いざ書こうとするときに一番気になるよう法がこれである。というか、関係代名詞は英語で重要視される「重複の回避」を実現するためにはなくてはならない文法である。",
        "　ただ、[** 前置詞＋関係代名詞]は[** 関係副詞]に置き換えられる（日時、場所、理由、方法の場合のみ）。",
        "[** of which]",
        " [/ of which] = [/ whose] となる場合。",
        " \t\tThis is the lake [/ whose] water is very clear.",
        " \t\t= This is the lake of [/ which] water is very clear.",
        "[** in which]",
        "　場所や空間を指す場合、以下のような言いかえが可能",
        "　\tThis is a house. He lives in it. -> a house = it -> （人以外なので）which に置き換える -> 先行詞の後ろに関係代名詞が来るように持っていく -> This is a house which he lives in = This is a house in which he lives.",
        "　\tこれを関係副詞を使って書き直すことも可能でその場合は This is a house [/ where] he lives. となる。",
        "",
        "今困っていること",
        "　関係副詞で置き換えられない場合の 前置詞+関係代名詞 の用法についてよくわからない",
        ""
      ]
    },
    {
      "title": "アウトライン構成",
      "created": 1616552450,
      "updated": 1616552683,
      "id": "605aa1fdc94358001f0e52d9",
      "lines": [
        "アウトライン構成",
        "#論文の書き方 #研究 #論文作成",
        "アウトライン構成は自分の頭の中を整理するために必ず必要なこと。これをせずに論文を書き始めるとあとでダメ出しをたくさん食らうことになる。",
        "",
        "[** アウトライン構成で気を付けたいこと]",
        "　全体の注意点",
        "　\t論文の目的は何か？",
        "　\t読者を想像、想定する",
        "　個々の注意点",
        "　\t書くべき事柄をすべて列挙する",
        "　\t事柄の論理の流れをいくつかのまとまりにする",
        ""
      ]
    },
    {
      "title": "簡明なスタイル",
      "created": 1616486298,
      "updated": 1616489792,
      "id": "60599f81559942002378af08",
      "lines": [
        "簡明なスタイル",
        "#EnglishWriting #英作文の技術",
        "",
        "[*** 簡明なスタイル]",
        "　基本的に論文での表現は『[* 簡明に徹すること]』を意識する。",
        "　役割のない単語を使わない",
        "　　行き過ぎた複合名詞句を避ける（複合名詞は dining-table といったものを指す）",
        "　　長い前置詞句（前置詞句は The cat is on the table の on からはじまる句）",
        "　一般的に科学論文の場合、一文は 15-25 語が適正と言われている",
        "　簡潔な句",
        "[https://gyazo.com/39c43537ef5bde1569d0f85ba9239238]",
        "",
        "[*** 日本人が多用しやすい漠然とした単語]",
        "　例えば、case, fact, process, situation, involve などがあるが、これらが不要な場合が多い。",
        "[https://gyazo.com/1c1c39a83eddcfd14e3ca9ecb72f4140]",
        "",
        "",
        "",
        "[** 参考資料]：",
        "[slide111111.pdf https://scrapbox.io/files/6059ad0e3854090023b147b3.pdf]",
        "[slide111118.pdf https://scrapbox.io/files/6059ad18461f19001c64a014.pdf]",
        "[slide111125.pdf https://scrapbox.io/files/6059ad22559942002378bf13.pdf]",
        ""
      ]
    },
    {
      "title": "Scrapboxの使い方",
      "created": 1568963453,
      "updated": 1568963453,
      "id": "5d847b7d72410d0017fc0565",
      "lines": [
        "Scrapboxの使い方",
        "Scrapboxへようこそ。このページは自由に編集して活用できます。",
        "",
        "このプロジェクトにメンバーを招待しましょう",
        "\tMenu -> Settings から他の人を招待できるリンクを取得できます。",
        " Scrapboxでは同一ページを複数人でリアルタイムに共同編集できます。",
        "",
        "基本的な使い方を試してみよう",
        "\t行頭にスペースまたはタブを入れて段落を作ることができます。",
        " `[ ]` で囲むと[別ページ]への[リンク]になります。",
        " `#` のあとに書いた文字は #ハッシュタグ になります。動作はリンクと同じです。",
        " `[ ]` の中にGyazoなどの画像URLやYoutube/Vimeoの動画URLを書くと画像や動画を表示できます。",
        " \t例:",
        "  \t[https://gyazo.com/5f93e65a3b979ae5333aca4f32600611]",
        "\t個人のプロフィールを設定して自分のページを作りましょう（Menu -> Edit profile）。その後、",
        " \t`Ctrl+I`を入力、または `[自分のユーザー名.icon]` を書くとアイコンを埋め込めます。",
        "  自分のページだけでなく、あらゆるページをアイコン化できます。例: [Scrapboxの使い方.icon]",
        "\tすべての記法は、[/help-jp/記法]をご覧ください",
        "",
        "リンクの効果的な使い方",
        "\t[Scrapbox]は、[リンク]から[つながり]を作ることで、関連するものを見つけ出し、整理できるのが特長です。",
        " \t[読んだ本]、[人物]、[タスク]など[自由]にリンクやハッシュタグを作っていきましょう！",
        "",
        "ページをトップに固定する (ピン留め)",
        " 右上のメニューから`Pin at home`を選択すると、ページをリストの一番上に固定できます。",
        " [https://gyazo.com/c3a68ab8928396608ef24349051c9d71]",
        " `Pin at home`には様々な活用方法があります。",
        "  自己紹介やプロジェクトの目的を書く",
        "  最初に読んでほしいページを目立たせる",
        "  招待URLを公開し、共同編集者を広く募る",
        "  新規投稿用のテンプレートを置く",
        "",
        "詳しい使い方",
        "\t[/help-jp/]をご覧ください。",
        " 英語版は[/help/]にあります。",
        "",
        "質問がある場合",
        "\t[お問い合わせ https://scrapbox.io/contact] からどうぞ。ご要望は[/forum-jp]でも受け付けています。",
        "",
        "使い方のサンプルが見たい",
        "\t[/help-jp/サンプル]を複数掲載しています",
        "",
        "企業でご利用の方へ",
        "\tNota社の社内利用の実例が[/nota-private-sample]にあります",
        " [企業の利用事例を掲載しています https://scrapbox.io/business]",
        "　[Scrapboxの企業での使い道 https://scrapbox.io/business/how-it-works]"
      ]
    }
  ]
}